Evlers/gd32f4xx_rt-thread/libraries/drivers/drv_enet/enet_phy/dp83867/dp83867_regs.h
/*
 * TX (RO)
 *
 * 100BASE-TX Support:
 * 1 = 100BASE-TX is supported by the Link Partner.
 * 0 = 100BASE-TX not supported by the Link Partner.
 */
#define DP83867_ANLPAR_TX_MASK (0x80U)
#define DP83867_ANLPAR_TX_SHIFT (7U)
#define DP83867_ANLPAR_TX_GET(x) (((uint16_t)(x) & DP83867_ANLPAR_TX_MASK) >> DP83867_ANLPAR_TX_SHIFT)

/*
 * 10_FD (RO)
 *
 * 10BASE-Te Full Duplex Support:
 * 1 = 10BASE-Te Full Duplex is supported by the Link Partner.
 * 0 = 10BASE-Te Full Duplex not supported by the Link Partner.
 */
#define DP83867_ANLPAR_10_FD_MASK (0x40U)
#define DP83867_ANLPAR_10_FD_SHIFT (6U)
#define DP83867_ANLPAR_10_FD_GET(x) (((uint16_t)(x) & DP83867_ANLPAR_10_FD_MASK) >> DP83867_ANLPAR_10_FD_SHIFT)

/*
 * 10 (RO)
 *
 * 10BASE-Te Support:
 * 1 = 10BASE-Te is supported by the Link Partner.
 * 0 = 10BASE-Te not supported by the Link Partner.
 */
#define DP83867_ANLPAR_10_MASK (0x20U)
#define DP83867_ANLPAR_10_SHIFT (5U)
#define DP83867_ANLPAR_10_GET(x) (((uint16_t)(x) & DP83867_ANLPAR_10_MASK) >> DP83867_ANLPAR_10_SHIFT)

/*
 * SELECTOR (RO)
 *
 * Protocol Selection Bits:
 * Link Partner's binary encoded protocol selector.
 */
#define DP83867_ANLPAR_SELECTOR_MASK (0x1FU)
#define DP83867_ANLPAR_SELECTOR_SHIFT (0U)
#define DP83867_ANLPAR_SELECTOR_GET(x) (((uint16_t)(x) & DP83867_ANLPAR_SELECTOR_MASK) >> DP83867_ANLPAR_SELECTOR_SHIFT)

/* Bitfield definition for register: ANER */
/*
 * RX_NEXT_PAGE_LOC_ABLE (RO)
 *
 * Receive Next Page Location Able:
 * 1 = Received Next Page storage location is specified by bit 6.5.
 * 0 = Received Next Page storage location is not specified by bit 6.5.
 */
#define DP83867_ANER_RX_NEXT_PAGE_LOC_ABLE_MASK (0x40U)
#define DP83867_ANER_RX_NEXT_PAGE_LOC_ABLE_SHIFT (6U)
#define DP83867_ANER_RX_NEXT_PAGE_LOC_ABLE_GET(x) (((uint16_t)(x) & DP83867_ANER_RX_NEXT_PAGE_LOC_ABLE_MASK) >> DP83867_ANER_RX_NEXT_PAGE_LOC_ABLE_SHIFT)

/*
 * RX_NEXT_PAGE_STOR_LOC (RO)
 *
 * Receive Next Page Storage Location:
 * 1 = Link Partner Next Pages are stored in register 8.
 * 0 = Link Partner Next Pages are stored in register 5.
 */
#define DP83867_ANER_RX_NEXT_PAGE_STOR_LOC_MASK (0x20U)
#define DP83867_ANER_RX_NEXT_PAGE_STOR_LOC_SHIFT (5U)
#define DP83867_ANER_RX_NEXT_PAGE_STOR_LOC_GET(x) (((uint16_t)(x) & DP83867_ANER_RX_NEXT_PAGE_STOR_LOC_MASK) >> DP83867_ANER_RX_NEXT_PAGE_STOR_LOC_SHIFT)

/*
 * PDF (RO)
 *
 * Parallel Detection Fault:
 * 1 = A fault has been detected via the Parallel Detection function.
 * 0 = A fault has not been detected.
 */
#define DP83867_ANER_PDF_MASK (0x10U)
#define DP83867_ANER_PDF_SHIFT (4U)
#define DP83867_ANER_PDF_GET(x) (((uint16_t)(x) & DP83867_ANER_PDF_MASK) >> DP83867_ANER_PDF_SHIFT)

/*
 * LP_NP_ABLE (RO)
 *
 * Link Partner Next Page Able:
 * 1 = Link Partner does support Next Page.
 * 0 = Link Partner does not support Next Page.
 */
#define DP83867_ANER_LP_NP_ABLE_MASK (0x8U)
#define DP83867_ANER_LP_NP_ABLE_SHIFT (3U)
#define DP83867_ANER_LP_NP_ABLE_GET(x) (((uint16_t)(x) & DP83867_ANER_LP_NP_ABLE_MASK) >> DP83867_ANER_LP_NP_ABLE_SHIFT)

/*
 * NP_ABLE (RO/P)
 *
 * Next Page Able:
 * 1 = Indicates local device is able to send additional Next Pages.
 */
#define DP83867_ANER_NP_ABLE_MASK (0x4U)
#define DP83867_ANER_NP_ABLE_SHIFT (2U)
#define DP83867_ANER_NP_ABLE_GET(x) (((uint16_t)(x) & DP83867_ANER_NP_ABLE_MASK) >> DP83867_ANER_NP_ABLE_SHIFT)

/*
 * PAGE_RX (RO/COR)
 *
 * Link Code Word Page Received:
 * 1 = Link Code Word has been received, cleared on a read.
 * 0 = Link Code Word has not been received.
 */
#define DP83867_ANER_PAGE_RX_MASK (0x2U)
#define DP83867_ANER_PAGE_RX_SHIFT (1U)
#define DP83867_ANER_PAGE_RX_GET(x) (((uint16_t)(x) & DP83867_ANER_PAGE_RX_MASK) >> DP83867_ANER_PAGE_RX_SHIFT)

/*
 * LP_AN_ABLE (RO)
 *
 * Link Partner Auto-Negotiation Able:
 * 1 = Indicates that the Link Partner supports Auto-Negotiation.
 * 0 = Indicates that the Link Partner does not support Auto-
 * Negotiation.
 */
#define DP83867_ANER_LP_AN_ABLE_MASK (0x1U)
#define DP83867_ANER_LP_AN_ABLE_SHIFT (0U)
#define DP83867_ANER_LP_AN_ABLE_GET(x) (((uint16_t)(x) & DP83867_ANER_LP_AN_ABLE_MASK) >> DP83867_ANER_LP_AN_ABLE_SHIFT)

/* Bitfield definition for register: ANNPTR */
/*
 * NP (RW)
 *
 * Next Page Indication:
 * 0 = No other Next Page Transfer desired.
 * 1 = Another Next Page desired.
 */
#define DP83867_ANNPTR_NP_MASK (0x8000U)
#define DP83867_ANNPTR_NP_SHIFT (15U)
#define DP83867_ANNPTR_NP_SET(x) (((uint16_t)(x) << DP83867_ANNPTR_NP_SHIFT) & DP83867_ANNPTR_NP_MASK)
#define DP83867_ANNPTR_NP_GET(x) (((uint16_t)(x) & DP83867_ANNPTR_NP_MASK) >> DP83867_ANNPTR_NP_SHIFT)

/*
 * ACK (RO)
 *
 * Acknowledge:
 * 1 = Acknowledge reception of link code word
 * 0 = Do not acknowledge of link code word.
 */
#define DP83867_ANNPTR_ACK_MASK (0x4000U)
#define DP83867_ANNPTR_ACK_SHIFT (14U)
#define DP83867_ANNPTR_ACK_GET(x) (((uint16_t)(x) & DP83867_ANNPTR_ACK_MASK) >> DP83867_ANNPTR_ACK_SHIFT)

/*
 * MP (RW)
 *
 * Message Page:
 * 1 = Current page is a Message Page.
 * 0 = Current page is an Unformatted Page.
 */
#define DP83867_ANNPTR_MP_MASK (0x2000U)
#define DP83867_ANNPTR_MP_SHIFT (13U)
#define DP83867_ANNPTR_MP_SET(x) (((uint16_t)(x) << DP83867_ANNPTR_MP_SHIFT) & DP83867_ANNPTR_MP_MASK)
#define DP83867_ANNPTR_MP_GET(x) (((uint16_t)(x) & DP83867_ANNPTR_MP_MASK) >> DP83867_ANNPTR_MP_SHIFT)

/*
 * ACK2 (RW)
 *
 * Acknowledge2:
 * 1 = Will comply with message.
 * 0 = Cannot comply with message.
 * Acknowledge2 is used by the next page function to indicate that
 * Local Device has the ability to comply with the message received.
 */
#define DP83867_ANNPTR_ACK2_MASK (0x1000U)
#define DP83867_ANNPTR_ACK2_SHIFT (12U)
#define DP83867_ANNPTR_ACK2_SET(x) (((uint16_t)(x) << DP83867_ANNPTR_ACK2_SHIFT) & DP83867_ANNPTR_ACK2_MASK)
#define DP83867_ANNPTR_ACK2_GET(x) (((uint16_t)(x) & DP83867_ANNPTR_ACK2_MASK) >> DP83867_ANNPTR_ACK2_SHIFT)

/*
 * TOG_TX (RO)
 *
 * Toggle:
 * 1 = Value of toggle bit in previously transmitted Link Code Word
 * was 0.
 * 0 = Value of toggle bit in previously transmitted Link Code Word
 * was 1.
 * Toggle is used by the Arbitration function within Auto-Negotiation to
 * ensure synchronization with the Link Partner during Next Page
 * exchange. This bit shall always take the opposite value of the
 * Toggle bit in the previously exchanged Link Code Word.
 */
#define DP83867_ANNPTR_TOG_TX_MASK (0x800U)
#define DP83867_ANNPTR_TOG_TX_SHIFT (11U)
#define DP83867_ANNPTR_TOG_TX_GET(x) (((uint16_t)(x) & DP83867_ANNPTR_TOG_TX_MASK) >> DP83867_ANNPTR_TOG_TX_SHIFT)

