Evlers/gd32f4xx_rt-thread/libraries/drivers/drv_enet/enet_phy/dp83867/dp83867_regs.h
/*
 * PORT_TYPE (RW)
 *
 * Advertise Device Type: Multi or single port:
 * 1 = Multi-port device.
 * 0 = Single-port device.
 */
#define DP83867_CFG1_PORT_TYPE_MASK (0x400U)
#define DP83867_CFG1_PORT_TYPE_SHIFT (10U)
#define DP83867_CFG1_PORT_TYPE_SET(x) (((uint16_t)(x) << DP83867_CFG1_PORT_TYPE_SHIFT) & DP83867_CFG1_PORT_TYPE_MASK)
#define DP83867_CFG1_PORT_TYPE_GET(x) (((uint16_t)(x) & DP83867_CFG1_PORT_TYPE_MASK) >> DP83867_CFG1_PORT_TYPE_SHIFT)

/*
 * 1000BASE_T_FULL_DUPLEX (RW)
 *
 * Advertise 1000BASE-T Full Duplex Capable:
 * 1 = Advertise 1000Base-T Full Duplex ability.
 * 0 = Do not advertise 1000Base-T Full Duplex ability.
 */
#define DP83867_CFG1_1000BASE_T_FULL_DUPLEX_MASK (0x200U)
#define DP83867_CFG1_1000BASE_T_FULL_DUPLEX_SHIFT (9U)
#define DP83867_CFG1_1000BASE_T_FULL_DUPLEX_SET(x) (((uint16_t)(x) << DP83867_CFG1_1000BASE_T_FULL_DUPLEX_SHIFT) & DP83867_CFG1_1000BASE_T_FULL_DUPLEX_MASK)
#define DP83867_CFG1_1000BASE_T_FULL_DUPLEX_GET(x) (((uint16_t)(x) & DP83867_CFG1_1000BASE_T_FULL_DUPLEX_MASK) >> DP83867_CFG1_1000BASE_T_FULL_DUPLEX_SHIFT)

/*
 * 1000BASE_T_HALF_DUPLEX (RW)
 *
 * Advertise 1000BASE-T Half Duplex Capable:
 * 1 = Advertise 1000Base-T Half Duplex ability.
 * 0 = Do not advertise 1000Base-T Half Duplex ability.
 */
#define DP83867_CFG1_1000BASE_T_HALF_DUPLEX_MASK (0x100U)
#define DP83867_CFG1_1000BASE_T_HALF_DUPLEX_SHIFT (8U)
#define DP83867_CFG1_1000BASE_T_HALF_DUPLEX_SET(x) (((uint16_t)(x) << DP83867_CFG1_1000BASE_T_HALF_DUPLEX_SHIFT) & DP83867_CFG1_1000BASE_T_HALF_DUPLEX_MASK)
#define DP83867_CFG1_1000BASE_T_HALF_DUPLEX_GET(x) (((uint16_t)(x) & DP83867_CFG1_1000BASE_T_HALF_DUPLEX_MASK) >> DP83867_CFG1_1000BASE_T_HALF_DUPLEX_SHIFT)

/*
 * TDR_AUTO_RUN (RW)
 *
 * Automatic TDR on Link Down:
 * 1 = Enable execution of TDR procedure after link down event.
 * 0 = Disable automatic execution of TDR.
 */
#define DP83867_CFG1_TDR_AUTO_RUN_MASK (0x80U)
#define DP83867_CFG1_TDR_AUTO_RUN_SHIFT (7U)
#define DP83867_CFG1_TDR_AUTO_RUN_SET(x) (((uint16_t)(x) << DP83867_CFG1_TDR_AUTO_RUN_SHIFT) & DP83867_CFG1_TDR_AUTO_RUN_MASK)
#define DP83867_CFG1_TDR_AUTO_RUN_GET(x) (((uint16_t)(x) & DP83867_CFG1_TDR_AUTO_RUN_MASK) >> DP83867_CFG1_TDR_AUTO_RUN_SHIFT)

/* Bitfield definition for register: STS1 */
/*
 * MASTER_SLAVE_CONFIGURATION_FAULT (RO, LH, COR)
 *
 * Master / Slave Manual Configuration Fault Detected:
 * 1 = Manual Master/Slave Configuration fault detected.
 * 0 = No Manual Master/Slave Configuration fault detected.
 */
#define DP83867_STS1_MASTER_SLAVE_CONFIGURATION_FAULT_MASK (0x8000U)
#define DP83867_STS1_MASTER_SLAVE_CONFIGURATION_FAULT_SHIFT (15U)
#define DP83867_STS1_MASTER_SLAVE_CONFIGURATION_FAULT_GET(x) (((uint16_t)(x) & DP83867_STS1_MASTER_SLAVE_CONFIGURATION_FAULT_MASK) >> DP83867_STS1_MASTER_SLAVE_CONFIGURATION_FAULT_SHIFT)

/*
 * MASTER_SLAVE_CONFIGURATION_RESOLUTION (RO)
 *
 * Master / Slave Configuration Results:
 * 1 = Configuration resolved to MASTER.
 * 0 = Configuration resolved to SLAVE.
 */
#define DP83867_STS1_MASTER_SLAVE_CONFIGURATION_RESOLUTION_MASK (0x4000U)
#define DP83867_STS1_MASTER_SLAVE_CONFIGURATION_RESOLUTION_SHIFT (14U)
#define DP83867_STS1_MASTER_SLAVE_CONFIGURATION_RESOLUTION_GET(x) (((uint16_t)(x) & DP83867_STS1_MASTER_SLAVE_CONFIGURATION_RESOLUTION_MASK) >> DP83867_STS1_MASTER_SLAVE_CONFIGURATION_RESOLUTION_SHIFT)

/*
 * LOCAL_RECEIVER_STATUS (RO)
 *
 * Local Receiver Status:
 * 1 = Local receiver is OK.
 * 0 = Local receiver is not OK.
 */
#define DP83867_STS1_LOCAL_RECEIVER_STATUS_MASK (0x2000U)
#define DP83867_STS1_LOCAL_RECEIVER_STATUS_SHIFT (13U)
#define DP83867_STS1_LOCAL_RECEIVER_STATUS_GET(x) (((uint16_t)(x) & DP83867_STS1_LOCAL_RECEIVER_STATUS_MASK) >> DP83867_STS1_LOCAL_RECEIVER_STATUS_SHIFT)

/*
 * REMOTE_RECEIVER_STATUS (RO)
 *
 * Remote Receiver Status:
 * 1 = Remote receiver is OK.
 * 0 = Remote receiver is not OK.
 */
#define DP83867_STS1_REMOTE_RECEIVER_STATUS_MASK (0x1000U)
#define DP83867_STS1_REMOTE_RECEIVER_STATUS_SHIFT (12U)
#define DP83867_STS1_REMOTE_RECEIVER_STATUS_GET(x) (((uint16_t)(x) & DP83867_STS1_REMOTE_RECEIVER_STATUS_MASK) >> DP83867_STS1_REMOTE_RECEIVER_STATUS_SHIFT)

/*
 * 1000BASE_T_FULL_DUPLEX (RO)
 *
 * Link Partner 1000BASE-T Full Duplex Capable:
 * 1 = Link Partner capable of 1000Base-T Full Duplex.
 * 0 = Link partner not capable of 1000Base-T Full Duplex.
 */
#define DP83867_STS1_1000BASE_T_FULL_DUPLEX_MASK (0x800U)
#define DP83867_STS1_1000BASE_T_FULL_DUPLEX_SHIFT (11U)
#define DP83867_STS1_1000BASE_T_FULL_DUPLEX_GET(x) (((uint16_t)(x) & DP83867_STS1_1000BASE_T_FULL_DUPLEX_MASK) >> DP83867_STS1_1000BASE_T_FULL_DUPLEX_SHIFT)

/*
 * 1000BASE_T_HALF_DUPLEX (RO)
 *
 * Link Partner 1000BASE-T Half Duplex Capable:
 * 1 = Link Partner capable of 1000Base-T Half Duplex.
 * 0 = Link partner not capable of 1000Base-T Half Duplex.
 */
#define DP83867_STS1_1000BASE_T_HALF_DUPLEX_MASK (0x400U)
#define DP83867_STS1_1000BASE_T_HALF_DUPLEX_SHIFT (10U)
#define DP83867_STS1_1000BASE_T_HALF_DUPLEX_GET(x) (((uint16_t)(x) & DP83867_STS1_1000BASE_T_HALF_DUPLEX_MASK) >> DP83867_STS1_1000BASE_T_HALF_DUPLEX_SHIFT)

/*
 * IDLE_ERROR_COUNTER (RO,COR)
 *
 * 1000BASE-T Idle Error Counter
 */
#define DP83867_STS1_IDLE_ERROR_COUNTER_MASK (0xFFU)
#define DP83867_STS1_IDLE_ERROR_COUNTER_SHIFT (0U)
#define DP83867_STS1_IDLE_ERROR_COUNTER_GET(x) (((uint16_t)(x) & DP83867_STS1_IDLE_ERROR_COUNTER_MASK) >> DP83867_STS1_IDLE_ERROR_COUNTER_SHIFT)

/* Bitfield definition for register: REGCR */
/*
 * FUNCTION (RW)
 *
 * 00 = Address
 * 01 = Data, no post increment
 * 10 = Data, post increment on read and write
 * 11 = Data, post increment on write only
 */
#define DP83867_REGCR_FUNCTION_MASK (0xC000U)
#define DP83867_REGCR_FUNCTION_SHIFT (14U)
#define DP83867_REGCR_FUNCTION_SET(x) (((uint16_t)(x) << DP83867_REGCR_FUNCTION_SHIFT) & DP83867_REGCR_FUNCTION_MASK)
#define DP83867_REGCR_FUNCTION_GET(x) (((uint16_t)(x) & DP83867_REGCR_FUNCTION_MASK) >> DP83867_REGCR_FUNCTION_SHIFT)

/*
 * DEVAD (RW)
 *
 * Device Address: In general, these bits [4:0] are the device address
 * DEVAD that directs any accesses of ADDAR register (0x000E) to
 * the appropriate MMD. Specifically, the DP83867 uses the vendor
 * specific DEVAD [4:0] = 11111 for accesses. All accesses through
 * registers REGCR and ADDAR should use this DEVAD.
 * Transactions with other DEVAD are ignored.
 */
#define DP83867_REGCR_DEVAD_MASK (0x1FU)
#define DP83867_REGCR_DEVAD_SHIFT (0U)
#define DP83867_REGCR_DEVAD_SET(x) (((uint16_t)(x) << DP83867_REGCR_DEVAD_SHIFT) & DP83867_REGCR_DEVAD_MASK)
#define DP83867_REGCR_DEVAD_GET(x) (((uint16_t)(x) & DP83867_REGCR_DEVAD_MASK) >> DP83867_REGCR_DEVAD_SHIFT)

/* Bitfield definition for register: ADDAR */
/*
 * ADDRESS_OR_DATA_REGISTER (RW)
 *
 * If REGCR register 15:14 = 00, holds the MMD DEVAD's address
 * register, otherwise holds the MMD DEVAD's data register
 */
#define DP83867_ADDAR_ADDRESS_OR_DATA_REGISTER_MASK (0xFFFFU)
#define DP83867_ADDAR_ADDRESS_OR_DATA_REGISTER_SHIFT (0U)
#define DP83867_ADDAR_ADDRESS_OR_DATA_REGISTER_SET(x) (((uint16_t)(x) << DP83867_ADDAR_ADDRESS_OR_DATA_REGISTER_SHIFT) & DP83867_ADDAR_ADDRESS_OR_DATA_REGISTER_MASK)
#define DP83867_ADDAR_ADDRESS_OR_DATA_REGISTER_GET(x) (((uint16_t)(x) & DP83867_ADDAR_ADDRESS_OR_DATA_REGISTER_MASK) >> DP83867_ADDAR_ADDRESS_OR_DATA_REGISTER_SHIFT)

/* Bitfield definition for register: 1KSCR */
/*
 * 1000BASE_X_FULL_DUPLEX (RO/P)
 *
 * 1000BASE-X Full Duplex Support:
 * 1 = 1000BASE-X Full Duplex is supported by the local device.
 * 0 = 1000BASE-X Full Duplex is not supported by the local device.
 */
#define DP83867_1KSCR_1000BASE_X_FULL_DUPLEX_MASK (0x8000U)
#define DP83867_1KSCR_1000BASE_X_FULL_DUPLEX_SHIFT (15U)
#define DP83867_1KSCR_1000BASE_X_FULL_DUPLEX_GET(x) (((uint16_t)(x) & DP83867_1KSCR_1000BASE_X_FULL_DUPLEX_MASK) >> DP83867_1KSCR_1000BASE_X_FULL_DUPLEX_SHIFT)

