Evlers/gd32f4xx_rt-thread/libraries/drivers/drv_enet/enet_phy/dp83867/dp83867_regs.h
/*
 * 1000BASE_X_HALF_DUPLEX (RO/P)
 *
 * 1000BASE-X Half Duplex Support:
 * 1 = 1000BASE-X Half Duplex is supported by the local device.
 * 0 = 1000BASE-X Half Duplex is not supported by the local device.
 */
#define DP83867_1KSCR_1000BASE_X_HALF_DUPLEX_MASK (0x4000U)
#define DP83867_1KSCR_1000BASE_X_HALF_DUPLEX_SHIFT (14U)
#define DP83867_1KSCR_1000BASE_X_HALF_DUPLEX_GET(x) (((uint16_t)(x) & DP83867_1KSCR_1000BASE_X_HALF_DUPLEX_MASK) >> DP83867_1KSCR_1000BASE_X_HALF_DUPLEX_SHIFT)

/*
 * 1000BASE_T_FULL_DUPLEX (RO/P)
 *
 * 1000BASE-T Full Duplex Support:
 * 1 = 1000BASE-T Full Duplex is supported by the local device.
 * 0 = 1000BASE-T Full Duplex is not supported by the local device.
 */
#define DP83867_1KSCR_1000BASE_T_FULL_DUPLEX_MASK (0x2000U)
#define DP83867_1KSCR_1000BASE_T_FULL_DUPLEX_SHIFT (13U)
#define DP83867_1KSCR_1000BASE_T_FULL_DUPLEX_GET(x) (((uint16_t)(x) & DP83867_1KSCR_1000BASE_T_FULL_DUPLEX_MASK) >> DP83867_1KSCR_1000BASE_T_FULL_DUPLEX_SHIFT)

/*
 * 1000BASE_T_HALF_DUPLEX (RO/P)
 *
 * 1000BASE-T Half Duplex Support:
 * 1 = 1000BASE-T Half Duplex is supported by the local device.
 * 0 = 1000BASE-T Half Duplex is not supported by the local device.
 */
#define DP83867_1KSCR_1000BASE_T_HALF_DUPLEX_MASK (0x1000U)
#define DP83867_1KSCR_1000BASE_T_HALF_DUPLEX_SHIFT (12U)
#define DP83867_1KSCR_1000BASE_T_HALF_DUPLEX_GET(x) (((uint16_t)(x) & DP83867_1KSCR_1000BASE_T_HALF_DUPLEX_MASK) >> DP83867_1KSCR_1000BASE_T_HALF_DUPLEX_SHIFT)

/* Bitfield definition for register: PHYCR */
/*
 * TX_FIFO_DEPTH (RW)
 *
 * TX FIFO Depth:
 * 11 = 8 bytes/nibbles (1000Mbps/Other Speeds)
 * 10 = 6 bytes/nibbles (1000Mbps/Other Speeds)
 * 01 = 4 bytes/nibbles (1000Mbps/Other Speeds)
 * 00 = 3 bytes/nibbles (1000Mbps/Other Speeds)
 * Note: FIFO is enabled only in the following modes:
 * 1000BaseT + GMII
 * 10BaseT/100BaseTX/1000BaseT + SGMII
 */
#define DP83867_PHYCR_TX_FIFO_DEPTH_MASK (0xC000U)
#define DP83867_PHYCR_TX_FIFO_DEPTH_SHIFT (14U)
#define DP83867_PHYCR_TX_FIFO_DEPTH_SET(x) (((uint16_t)(x) << DP83867_PHYCR_TX_FIFO_DEPTH_SHIFT) & DP83867_PHYCR_TX_FIFO_DEPTH_MASK)
#define DP83867_PHYCR_TX_FIFO_DEPTH_GET(x) (((uint16_t)(x) & DP83867_PHYCR_TX_FIFO_DEPTH_MASK) >> DP83867_PHYCR_TX_FIFO_DEPTH_SHIFT)

/*
 * RX_FIFO_DEPTH (RW)
 *
 * RX FIFO Depth:
 * 11 = 8 bytes/nibbles (1000 Mbps/Other Speeds)
 * 10 = 6 bytes/nibbles (1000 Mbps/Other Speeds)
 * 01 = 4 bytes/nibbles (1000 Mbps/Other Speeds)
 * 00 = 3 bytes/nibbles (1000 Mbps/Other Speeds)
 * Note: FIFO is enabled only in SGMII
 */
#define DP83867_PHYCR_RX_FIFO_DEPTH_MASK (0x3000U)
#define DP83867_PHYCR_RX_FIFO_DEPTH_SHIFT (12U)
#define DP83867_PHYCR_RX_FIFO_DEPTH_SET(x) (((uint16_t)(x) << DP83867_PHYCR_RX_FIFO_DEPTH_SHIFT) & DP83867_PHYCR_RX_FIFO_DEPTH_MASK)
#define DP83867_PHYCR_RX_FIFO_DEPTH_GET(x) (((uint16_t)(x) & DP83867_PHYCR_RX_FIFO_DEPTH_MASK) >> DP83867_PHYCR_RX_FIFO_DEPTH_SHIFT)

/*
 * SGMII_EN (RW)
 *
 * SGMII Enable:
 * 1 = Enable SGMII
 * 0 = Disable SGMII
 */
#define DP83867_PHYCR_SGMII_EN_MASK (0x800U)
#define DP83867_PHYCR_SGMII_EN_SHIFT (11U)
#define DP83867_PHYCR_SGMII_EN_SET(x) (((uint16_t)(x) << DP83867_PHYCR_SGMII_EN_SHIFT) & DP83867_PHYCR_SGMII_EN_MASK)
#define DP83867_PHYCR_SGMII_EN_GET(x) (((uint16_t)(x) & DP83867_PHYCR_SGMII_EN_MASK) >> DP83867_PHYCR_SGMII_EN_SHIFT)

/*
 * FORCE_LINK_GOOD (RW)
 *
 * Force Link Good:
 * 1 = Force link good according to the selected speed.
 * 0 = Normal operation
 */
#define DP83867_PHYCR_FORCE_LINK_GOOD_MASK (0x400U)
#define DP83867_PHYCR_FORCE_LINK_GOOD_SHIFT (10U)
#define DP83867_PHYCR_FORCE_LINK_GOOD_SET(x) (((uint16_t)(x) << DP83867_PHYCR_FORCE_LINK_GOOD_SHIFT) & DP83867_PHYCR_FORCE_LINK_GOOD_MASK)
#define DP83867_PHYCR_FORCE_LINK_GOOD_GET(x) (((uint16_t)(x) & DP83867_PHYCR_FORCE_LINK_GOOD_MASK) >> DP83867_PHYCR_FORCE_LINK_GOOD_SHIFT)

/*
 * POWER_SAVE_MODE (RW)
 *
 * Power-Saving Modes:
 * 11 = Passive Sleep mode: Power down all digital and analog
 * blocks.
 * 10 =Active Sleep mode: Power down all digital and analog blocks.
 * Automatic power-up is performed when link partner is detected. Link
 * pulses are transmitted approximately once per 1.4 Sec in this mode
 * to wake up any potential link partner.
 * 01 = IEEE mode: power down all digital and analog blocks.
 * Note: If DISABLE_CLK_125 (bit [4]of this register) is set to zero, the
 * PLL is also powered down.
 * 00 = Normal mode
 */
#define DP83867_PHYCR_POWER_SAVE_MODE_MASK (0x300U)
#define DP83867_PHYCR_POWER_SAVE_MODE_SHIFT (8U)
#define DP83867_PHYCR_POWER_SAVE_MODE_SET(x) (((uint16_t)(x) << DP83867_PHYCR_POWER_SAVE_MODE_SHIFT) & DP83867_PHYCR_POWER_SAVE_MODE_MASK)
#define DP83867_PHYCR_POWER_SAVE_MODE_GET(x) (((uint16_t)(x) & DP83867_PHYCR_POWER_SAVE_MODE_MASK) >> DP83867_PHYCR_POWER_SAVE_MODE_SHIFT)

/*
 * DEEP_POWER_DOWN_EN (RW)
 *
 * Deep power-down mode enable
 * 1 = When power down is initiated through assertion of the external
 * power-down pin or through the POWER_DOWN bit in the BMCR,
 * the device enters a deep power-down mode.
 * 0 = Normal operation.
 */
#define DP83867_PHYCR_DEEP_POWER_DOWN_EN_MASK (0x80U)
#define DP83867_PHYCR_DEEP_POWER_DOWN_EN_SHIFT (7U)
#define DP83867_PHYCR_DEEP_POWER_DOWN_EN_SET(x) (((uint16_t)(x) << DP83867_PHYCR_DEEP_POWER_DOWN_EN_SHIFT) & DP83867_PHYCR_DEEP_POWER_DOWN_EN_MASK)
#define DP83867_PHYCR_DEEP_POWER_DOWN_EN_GET(x) (((uint16_t)(x) & DP83867_PHYCR_DEEP_POWER_DOWN_EN_MASK) >> DP83867_PHYCR_DEEP_POWER_DOWN_EN_SHIFT)

/*
 * MDI_CROSSOVER (RW)
 *
 * MDI Crosssover Mode:
 * 1x = Enable automatic crossover
 * 01 = Manual MDI-X configuration
 * 00 = Manual MDI configuration
 */
#define DP83867_PHYCR_MDI_CROSSOVER_MASK (0x60U)
#define DP83867_PHYCR_MDI_CROSSOVER_SHIFT (5U)
#define DP83867_PHYCR_MDI_CROSSOVER_SET(x) (((uint16_t)(x) << DP83867_PHYCR_MDI_CROSSOVER_SHIFT) & DP83867_PHYCR_MDI_CROSSOVER_MASK)
#define DP83867_PHYCR_MDI_CROSSOVER_GET(x) (((uint16_t)(x) & DP83867_PHYCR_MDI_CROSSOVER_MASK) >> DP83867_PHYCR_MDI_CROSSOVER_SHIFT)

/*
 * DISABLE_CLK_125 (RW)
 *
 * Disable 125MHz Clock:
 * This bit may be used in conjunction with POWER_SAVE_MODE
 * (bits 9:8 of this register).
 * 1 = Disable CLK125.
 * 0 = Enable CLK125.
 */
#define DP83867_PHYCR_DISABLE_CLK_125_MASK (0x10U)
#define DP83867_PHYCR_DISABLE_CLK_125_SHIFT (4U)
#define DP83867_PHYCR_DISABLE_CLK_125_SET(x) (((uint16_t)(x) << DP83867_PHYCR_DISABLE_CLK_125_SHIFT) & DP83867_PHYCR_DISABLE_CLK_125_MASK)
#define DP83867_PHYCR_DISABLE_CLK_125_GET(x) (((uint16_t)(x) & DP83867_PHYCR_DISABLE_CLK_125_MASK) >> DP83867_PHYCR_DISABLE_CLK_125_SHIFT)

