Evlers/gd32f4xx_rt-thread/libraries/drivers/drv_enet/enet_phy/dp83867/dp83867_regs.h
/*
 * STANDBY_MODE (RW)
 *
 * Standby Mode:
 * 1 = Enable standby mode. Digital and analog circuitry are powered
 * up, but no link can be established.
 * 0 = Normal operation.
 */
#define DP83867_PHYCR_STANDBY_MODE_MASK (0x4U)
#define DP83867_PHYCR_STANDBY_MODE_SHIFT (2U)
#define DP83867_PHYCR_STANDBY_MODE_SET(x) (((uint16_t)(x) << DP83867_PHYCR_STANDBY_MODE_SHIFT) & DP83867_PHYCR_STANDBY_MODE_MASK)
#define DP83867_PHYCR_STANDBY_MODE_GET(x) (((uint16_t)(x) & DP83867_PHYCR_STANDBY_MODE_MASK) >> DP83867_PHYCR_STANDBY_MODE_SHIFT)

/*
 * LINE_DRIVER_INV_EN (RW)
 *
 * Line Driver Inversion Enable:
 * 1 = Invert Line Driver Transmission.
 * 0 = Normal operation.
 */
#define DP83867_PHYCR_LINE_DRIVER_INV_EN_MASK (0x2U)
#define DP83867_PHYCR_LINE_DRIVER_INV_EN_SHIFT (1U)
#define DP83867_PHYCR_LINE_DRIVER_INV_EN_SET(x) (((uint16_t)(x) << DP83867_PHYCR_LINE_DRIVER_INV_EN_SHIFT) & DP83867_PHYCR_LINE_DRIVER_INV_EN_MASK)
#define DP83867_PHYCR_LINE_DRIVER_INV_EN_GET(x) (((uint16_t)(x) & DP83867_PHYCR_LINE_DRIVER_INV_EN_MASK) >> DP83867_PHYCR_LINE_DRIVER_INV_EN_SHIFT)

/*
 * DISABLE_JABBER (RW)
 *
 * Disable Jabber
 * 1 = Disable Jabber function.
 * 0 = Enable Jabber function.
 */
#define DP83867_PHYCR_DISABLE_JABBER_MASK (0x1U)
#define DP83867_PHYCR_DISABLE_JABBER_SHIFT (0U)
#define DP83867_PHYCR_DISABLE_JABBER_SET(x) (((uint16_t)(x) << DP83867_PHYCR_DISABLE_JABBER_SHIFT) & DP83867_PHYCR_DISABLE_JABBER_MASK)
#define DP83867_PHYCR_DISABLE_JABBER_GET(x) (((uint16_t)(x) & DP83867_PHYCR_DISABLE_JABBER_MASK) >> DP83867_PHYCR_DISABLE_JABBER_SHIFT)

/* Bitfield definition for register: PHYSTS */
/*
 * SPEED_SELECTION (RO)
 *
 * Speed Select Status:
 * These two bits indicate the speed of operation as determined by
 * Auto-Negotiation or as set by manual configuration.
 * 11 = Reserved
 * 10 = 1000 Mbps
 * 01 = 100 Mbps
 * 00 = 10 Mbps
 */
#define DP83867_PHYSTS_SPEED_SELECTION_MASK (0xC000U)
#define DP83867_PHYSTS_SPEED_SELECTION_SHIFT (14U)
#define DP83867_PHYSTS_SPEED_SELECTION_GET(x) (((uint16_t)(x) & DP83867_PHYSTS_SPEED_SELECTION_MASK) >> DP83867_PHYSTS_SPEED_SELECTION_SHIFT)

/*
 * DUPLEX_MODE (RO)
 *
 * Duplex Mode Status:
 * 1 = Full Duplex
 * 0 = Half Duplex.
 */
#define DP83867_PHYSTS_DUPLEX_MODE_MASK (0x2000U)
#define DP83867_PHYSTS_DUPLEX_MODE_SHIFT (13U)
#define DP83867_PHYSTS_DUPLEX_MODE_GET(x) (((uint16_t)(x) & DP83867_PHYSTS_DUPLEX_MODE_MASK) >> DP83867_PHYSTS_DUPLEX_MODE_SHIFT)

/*
 * PAGE_RECEIVED ( RO, LH, COR)
 *
 * Page Received:
 * This bit is latched high and will be cleared upon a read.
 * 1 = Page received.
 * 0 = No page received.
 */
#define DP83867_PHYSTS_PAGE_RECEIVED_MASK (0x1000U)
#define DP83867_PHYSTS_PAGE_RECEIVED_SHIFT (12U)
#define DP83867_PHYSTS_PAGE_RECEIVED_GET(x) (((uint16_t)(x) & DP83867_PHYSTS_PAGE_RECEIVED_MASK) >> DP83867_PHYSTS_PAGE_RECEIVED_SHIFT)

/*
 * SPEED_DUPLEX_RESOLVED (RO)
 *
 * Speed Duplex Resolution Status:
 * 1 = Auto-Negotiation has completed or is disabled.
 * 0 = Auto-Negotiation is enabled and has not completed.
 */
#define DP83867_PHYSTS_SPEED_DUPLEX_RESOLVED_MASK (0x800U)
#define DP83867_PHYSTS_SPEED_DUPLEX_RESOLVED_SHIFT (11U)
#define DP83867_PHYSTS_SPEED_DUPLEX_RESOLVED_GET(x) (((uint16_t)(x) & DP83867_PHYSTS_SPEED_DUPLEX_RESOLVED_MASK) >> DP83867_PHYSTS_SPEED_DUPLEX_RESOLVED_SHIFT)

/*
 * LINK_STATUS (RO)
 *
 * Link Status:
 * 1 = Link is up.
 * 0 = Link is down.
 */
#define DP83867_PHYSTS_LINK_STATUS_MASK (0x400U)
#define DP83867_PHYSTS_LINK_STATUS_SHIFT (10U)
#define DP83867_PHYSTS_LINK_STATUS_GET(x) (((uint16_t)(x) & DP83867_PHYSTS_LINK_STATUS_MASK) >> DP83867_PHYSTS_LINK_STATUS_SHIFT)

/*
 * MDI_X_MODE_CD (RO)
 *
 * MDI/MDIX Resolution Status for C and D Line Driver Pairs:
 * 1 = Resolved as MDIX
 * 0 = Resolved as MDI.
 */
#define DP83867_PHYSTS_MDI_X_MODE_CD_MASK (0x200U)
#define DP83867_PHYSTS_MDI_X_MODE_CD_SHIFT (9U)
#define DP83867_PHYSTS_MDI_X_MODE_CD_GET(x) (((uint16_t)(x) & DP83867_PHYSTS_MDI_X_MODE_CD_MASK) >> DP83867_PHYSTS_MDI_X_MODE_CD_SHIFT)

/*
 * MDI_X_MODE_AB (RO)
 *
 * MDI/MDIX Resolution Status for A and B Line Driver Pairs:
 * 1 = Resolved as MDIX
 * 0 = Resolved as MDI.
 */
#define DP83867_PHYSTS_MDI_X_MODE_AB_MASK (0x100U)
#define DP83867_PHYSTS_MDI_X_MODE_AB_SHIFT (8U)
#define DP83867_PHYSTS_MDI_X_MODE_AB_GET(x) (((uint16_t)(x) & DP83867_PHYSTS_MDI_X_MODE_AB_MASK) >> DP83867_PHYSTS_MDI_X_MODE_AB_SHIFT)

/*
 * SPEED_OPT_STATUS (RO)
 *
 * Speed Optimization Status:
 * 1 = Auto-Negotiation is currently being performed with Speed
 * Optimization masking 1000BaseT abilities (Valid only during Auto-
 * Negotiation).
 * 0 = Auto-Negotiation is currently being performed without Speed
 * Optimization.
 */
#define DP83867_PHYSTS_SPEED_OPT_STATUS_MASK (0x80U)
#define DP83867_PHYSTS_SPEED_OPT_STATUS_SHIFT (7U)
#define DP83867_PHYSTS_SPEED_OPT_STATUS_GET(x) (((uint16_t)(x) & DP83867_PHYSTS_SPEED_OPT_STATUS_MASK) >> DP83867_PHYSTS_SPEED_OPT_STATUS_SHIFT)

/*
 * SLEEP_MODE (RO)
 *
 * Sleep Mode Status:
 * 1 = Device currently in sleep mode.
 * 0 = Device currently in active mode.
 */
#define DP83867_PHYSTS_SLEEP_MODE_MASK (0x40U)
#define DP83867_PHYSTS_SLEEP_MODE_SHIFT (6U)
#define DP83867_PHYSTS_SLEEP_MODE_GET(x) (((uint16_t)(x) & DP83867_PHYSTS_SLEEP_MODE_MASK) >> DP83867_PHYSTS_SLEEP_MODE_SHIFT)

/*
 * WIRE_CROSS (RO)
 *
 * Crossed Wire Indication:
 * Indicates channel polarity in 1000BASE-T linked status. Bits [5:2]
 * correspond to channels [D,C,B,A], respectively.
 * 1 = Channel polarity is reversed.
 * 0 = Channel polarity is normal.
 */
#define DP83867_PHYSTS_WIRE_CROSS_MASK (0x3CU)
#define DP83867_PHYSTS_WIRE_CROSS_SHIFT (2U)
#define DP83867_PHYSTS_WIRE_CROSS_GET(x) (((uint16_t)(x) & DP83867_PHYSTS_WIRE_CROSS_MASK) >> DP83867_PHYSTS_WIRE_CROSS_SHIFT)

/*
 * POLARITY_STATUS (RO)
 *
 * 10BASE-Te Polarity Status:
 * 1 = Correct Polarity detected.
 * 0 = Inverted Polarity detected.
 */
#define DP83867_PHYSTS_POLARITY_STATUS_MASK (0x2U)
#define DP83867_PHYSTS_POLARITY_STATUS_SHIFT (1U)
#define DP83867_PHYSTS_POLARITY_STATUS_GET(x) (((uint16_t)(x) & DP83867_PHYSTS_POLARITY_STATUS_MASK) >> DP83867_PHYSTS_POLARITY_STATUS_SHIFT)

