Evlers/gd32f4xx_rt-thread/libraries/drivers/drv_enet/enet_phy/dp83867/dp83867_regs.h
/*
 * JABBER_DETECT (RO)
 *
 * Jabber Detect: This bit only has meaning in 10 Mbps mode.
 * This bit is a duplicate of the Jabber Detect bit in the BMSR register,
 * except that it is not cleared upon a read of the PHYSTS register.
 * 1 = Jabber condition detected.
 * 0 = No Jabber.
 */
#define DP83867_PHYSTS_JABBER_DETECT_MASK (0x1U)
#define DP83867_PHYSTS_JABBER_DETECT_SHIFT (0U)
#define DP83867_PHYSTS_JABBER_DETECT_GET(x) (((uint16_t)(x) & DP83867_PHYSTS_JABBER_DETECT_MASK) >> DP83867_PHYSTS_JABBER_DETECT_SHIFT)

/* Bitfield definition for register: MICR */
/*
 * AUTONEG_ERR_INT_EN (RW)
 *
 * Enable Auto-Negotiation Error Interrupt:
 * 1 = Enable Auto-Negotiation Error interrupt.
 * 0 = Disable Auto-Negotiation Error interrupt.
 */
#define DP83867_MICR_AUTONEG_ERR_INT_EN_MASK (0x8000U)
#define DP83867_MICR_AUTONEG_ERR_INT_EN_SHIFT (15U)
#define DP83867_MICR_AUTONEG_ERR_INT_EN_SET(x) (((uint16_t)(x) << DP83867_MICR_AUTONEG_ERR_INT_EN_SHIFT) & DP83867_MICR_AUTONEG_ERR_INT_EN_MASK)
#define DP83867_MICR_AUTONEG_ERR_INT_EN_GET(x) (((uint16_t)(x) & DP83867_MICR_AUTONEG_ERR_INT_EN_MASK) >> DP83867_MICR_AUTONEG_ERR_INT_EN_SHIFT)

/*
 * SPEED_CHNG_INT_EN (RW)
 *
 * Enable Speed Change Interrupt:
 * 1 = Enable Speed Change interrupt.
 * 0 = Disable Speed Change interrupt.
 */
#define DP83867_MICR_SPEED_CHNG_INT_EN_MASK (0x4000U)
#define DP83867_MICR_SPEED_CHNG_INT_EN_SHIFT (14U)
#define DP83867_MICR_SPEED_CHNG_INT_EN_SET(x) (((uint16_t)(x) << DP83867_MICR_SPEED_CHNG_INT_EN_SHIFT) & DP83867_MICR_SPEED_CHNG_INT_EN_MASK)
#define DP83867_MICR_SPEED_CHNG_INT_EN_GET(x) (((uint16_t)(x) & DP83867_MICR_SPEED_CHNG_INT_EN_MASK) >> DP83867_MICR_SPEED_CHNG_INT_EN_SHIFT)

/*
 * DUPLEX_MODE_CHNG_INT_EN (RW)
 *
 * Enable Duplex Mode Change Interrupt:
 * 1 = Enable Duplex Mode Change interrupt.
 * 0 = Disable Duplex Mode Change interrupt.
 */
#define DP83867_MICR_DUPLEX_MODE_CHNG_INT_EN_MASK (0x2000U)
#define DP83867_MICR_DUPLEX_MODE_CHNG_INT_EN_SHIFT (13U)
#define DP83867_MICR_DUPLEX_MODE_CHNG_INT_EN_SET(x) (((uint16_t)(x) << DP83867_MICR_DUPLEX_MODE_CHNG_INT_EN_SHIFT) & DP83867_MICR_DUPLEX_MODE_CHNG_INT_EN_MASK)
#define DP83867_MICR_DUPLEX_MODE_CHNG_INT_EN_GET(x) (((uint16_t)(x) & DP83867_MICR_DUPLEX_MODE_CHNG_INT_EN_MASK) >> DP83867_MICR_DUPLEX_MODE_CHNG_INT_EN_SHIFT)

/*
 * PAGE_RECEIVED_INT_EN (RW)
 *
 * Enable Page Received Interrupt:
 * 1 = Enable Page Received Interrupt.
 * 0 = Disable Page Received Interrupt.
 */
#define DP83867_MICR_PAGE_RECEIVED_INT_EN_MASK (0x1000U)
#define DP83867_MICR_PAGE_RECEIVED_INT_EN_SHIFT (12U)
#define DP83867_MICR_PAGE_RECEIVED_INT_EN_SET(x) (((uint16_t)(x) << DP83867_MICR_PAGE_RECEIVED_INT_EN_SHIFT) & DP83867_MICR_PAGE_RECEIVED_INT_EN_MASK)
#define DP83867_MICR_PAGE_RECEIVED_INT_EN_GET(x) (((uint16_t)(x) & DP83867_MICR_PAGE_RECEIVED_INT_EN_MASK) >> DP83867_MICR_PAGE_RECEIVED_INT_EN_SHIFT)

/*
 * AUTONEG_COMP_INT_EN (RW)
 *
 * Enable Auto-Negotiation Complete Interrupt:
 * 1 = Enable Auto-Negotiation Complete Interrupt.
 * 0 = Disable Auto-Negotiation Complete Interrupt.
 */
#define DP83867_MICR_AUTONEG_COMP_INT_EN_MASK (0x800U)
#define DP83867_MICR_AUTONEG_COMP_INT_EN_SHIFT (11U)
#define DP83867_MICR_AUTONEG_COMP_INT_EN_SET(x) (((uint16_t)(x) << DP83867_MICR_AUTONEG_COMP_INT_EN_SHIFT) & DP83867_MICR_AUTONEG_COMP_INT_EN_MASK)
#define DP83867_MICR_AUTONEG_COMP_INT_EN_GET(x) (((uint16_t)(x) & DP83867_MICR_AUTONEG_COMP_INT_EN_MASK) >> DP83867_MICR_AUTONEG_COMP_INT_EN_SHIFT)

/*
 * LINK_STATUS_CHNG_INT_EN (RW)
 *
 * Enable Link Status Change Interrupt:
 * 1 = Enable Link Status Change interrupt.
 * 0 = Disable Link Status Change interrupt.
 */
#define DP83867_MICR_LINK_STATUS_CHNG_INT_EN_MASK (0x400U)
#define DP83867_MICR_LINK_STATUS_CHNG_INT_EN_SHIFT (10U)
#define DP83867_MICR_LINK_STATUS_CHNG_INT_EN_SET(x) (((uint16_t)(x) << DP83867_MICR_LINK_STATUS_CHNG_INT_EN_SHIFT) & DP83867_MICR_LINK_STATUS_CHNG_INT_EN_MASK)
#define DP83867_MICR_LINK_STATUS_CHNG_INT_EN_GET(x) (((uint16_t)(x) & DP83867_MICR_LINK_STATUS_CHNG_INT_EN_MASK) >> DP83867_MICR_LINK_STATUS_CHNG_INT_EN_SHIFT)

/*
 * FALSE_CARRIER_INT_EN (RW)
 *
 * Enable False Carrier Interrupt:
 * 1 = Enable False Carrier interrupt.
 * 0 = Disable False Carrier interrupt.
 */
#define DP83867_MICR_FALSE_CARRIER_INT_EN_MASK (0x100U)
#define DP83867_MICR_FALSE_CARRIER_INT_EN_SHIFT (8U)
#define DP83867_MICR_FALSE_CARRIER_INT_EN_SET(x) (((uint16_t)(x) << DP83867_MICR_FALSE_CARRIER_INT_EN_SHIFT) & DP83867_MICR_FALSE_CARRIER_INT_EN_MASK)
#define DP83867_MICR_FALSE_CARRIER_INT_EN_GET(x) (((uint16_t)(x) & DP83867_MICR_FALSE_CARRIER_INT_EN_MASK) >> DP83867_MICR_FALSE_CARRIER_INT_EN_SHIFT)

/*
 * MDI_CROSSOVER_CHNG_INT_EN (RW)
 *
 * Enable MDI Crossover Change Interrupt:
 * 1 = Enable MDI Crossover Change interrupt.
 * 0 = Disable MDI Crossover Change interrupt.
 */
#define DP83867_MICR_MDI_CROSSOVER_CHNG_INT_EN_MASK (0x40U)
#define DP83867_MICR_MDI_CROSSOVER_CHNG_INT_EN_SHIFT (6U)
#define DP83867_MICR_MDI_CROSSOVER_CHNG_INT_EN_SET(x) (((uint16_t)(x) << DP83867_MICR_MDI_CROSSOVER_CHNG_INT_EN_SHIFT) & DP83867_MICR_MDI_CROSSOVER_CHNG_INT_EN_MASK)
#define DP83867_MICR_MDI_CROSSOVER_CHNG_INT_EN_GET(x) (((uint16_t)(x) & DP83867_MICR_MDI_CROSSOVER_CHNG_INT_EN_MASK) >> DP83867_MICR_MDI_CROSSOVER_CHNG_INT_EN_SHIFT)

/*
 * SPEED_OPT_EVENT_INT_EN (RW)
 *
 * Enable Speed Optimization Event Interrupt:
 * 1 = Enable Speed Optimization Event Interrupt.
 * 0 = Disable Speed Optimization Event Interrupt.
 */
#define DP83867_MICR_SPEED_OPT_EVENT_INT_EN_MASK (0x20U)
#define DP83867_MICR_SPEED_OPT_EVENT_INT_EN_SHIFT (5U)
#define DP83867_MICR_SPEED_OPT_EVENT_INT_EN_SET(x) (((uint16_t)(x) << DP83867_MICR_SPEED_OPT_EVENT_INT_EN_SHIFT) & DP83867_MICR_SPEED_OPT_EVENT_INT_EN_MASK)
#define DP83867_MICR_SPEED_OPT_EVENT_INT_EN_GET(x) (((uint16_t)(x) & DP83867_MICR_SPEED_OPT_EVENT_INT_EN_MASK) >> DP83867_MICR_SPEED_OPT_EVENT_INT_EN_SHIFT)

/*
 * SLEEP_MODE_CHNG_INT_EN (RW)
 *
 * Enable Sleep Mode Change Interrupt:
 * 1 = Enable Sleep Mode Change Interrupt.
 * 0 = Disable Sleep Mode Change Interrupt.
 */
#define DP83867_MICR_SLEEP_MODE_CHNG_INT_EN_MASK (0x10U)
#define DP83867_MICR_SLEEP_MODE_CHNG_INT_EN_SHIFT (4U)
#define DP83867_MICR_SLEEP_MODE_CHNG_INT_EN_SET(x) (((uint16_t)(x) << DP83867_MICR_SLEEP_MODE_CHNG_INT_EN_SHIFT) & DP83867_MICR_SLEEP_MODE_CHNG_INT_EN_MASK)
#define DP83867_MICR_SLEEP_MODE_CHNG_INT_EN_GET(x) (((uint16_t)(x) & DP83867_MICR_SLEEP_MODE_CHNG_INT_EN_MASK) >> DP83867_MICR_SLEEP_MODE_CHNG_INT_EN_SHIFT)

