Evlers/gd32f4xx_rt-thread/libraries/drivers/drv_enet/enet_phy/dp83867/dp83867_regs.h
/*
 * WOL_INT_EN (RW)
 *
 * Enable Wake-on-LAN Interrupt:
 * 1 = Enable Wake-on-LAN Interrupt.
 * 0 = Disable Wake-on-LAN Interrupt.
 */
#define DP83867_MICR_WOL_INT_EN_MASK (0x8U)
#define DP83867_MICR_WOL_INT_EN_SHIFT (3U)
#define DP83867_MICR_WOL_INT_EN_SET(x) (((uint16_t)(x) << DP83867_MICR_WOL_INT_EN_SHIFT) & DP83867_MICR_WOL_INT_EN_MASK)
#define DP83867_MICR_WOL_INT_EN_GET(x) (((uint16_t)(x) & DP83867_MICR_WOL_INT_EN_MASK) >> DP83867_MICR_WOL_INT_EN_SHIFT)

/*
 * XGMII_ERR_INT_EN (RW)
 *
 * Enable xGMII Error Interrupt:
 * 1 = Enable xGMII Error Interrupt.
 * 0 = Disable xGMII Error Interrupt.
 */
#define DP83867_MICR_XGMII_ERR_INT_EN_MASK (0x4U)
#define DP83867_MICR_XGMII_ERR_INT_EN_SHIFT (2U)
#define DP83867_MICR_XGMII_ERR_INT_EN_SET(x) (((uint16_t)(x) << DP83867_MICR_XGMII_ERR_INT_EN_SHIFT) & DP83867_MICR_XGMII_ERR_INT_EN_MASK)
#define DP83867_MICR_XGMII_ERR_INT_EN_GET(x) (((uint16_t)(x) & DP83867_MICR_XGMII_ERR_INT_EN_MASK) >> DP83867_MICR_XGMII_ERR_INT_EN_SHIFT)

/*
 * POLARITY_CHNG_INT_EN (RW)
 *
 * Enable Polarity Change Interrupt:
 * 1 = Enable Polarity Change interrupt.
 * 0 = Disable Polarity Change interrupt.
 */
#define DP83867_MICR_POLARITY_CHNG_INT_EN_MASK (0x2U)
#define DP83867_MICR_POLARITY_CHNG_INT_EN_SHIFT (1U)
#define DP83867_MICR_POLARITY_CHNG_INT_EN_SET(x) (((uint16_t)(x) << DP83867_MICR_POLARITY_CHNG_INT_EN_SHIFT) & DP83867_MICR_POLARITY_CHNG_INT_EN_MASK)
#define DP83867_MICR_POLARITY_CHNG_INT_EN_GET(x) (((uint16_t)(x) & DP83867_MICR_POLARITY_CHNG_INT_EN_MASK) >> DP83867_MICR_POLARITY_CHNG_INT_EN_SHIFT)

/*
 * JABBER_INT_EN (RW)
 *
 * Enable Jabber Interrupt:
 * 1 = Enable Jabber interrupt.
 * 0 = Disable Jabber interrupt.
 */
#define DP83867_MICR_JABBER_INT_EN_MASK (0x1U)
#define DP83867_MICR_JABBER_INT_EN_SHIFT (0U)
#define DP83867_MICR_JABBER_INT_EN_SET(x) (((uint16_t)(x) << DP83867_MICR_JABBER_INT_EN_SHIFT) & DP83867_MICR_JABBER_INT_EN_MASK)
#define DP83867_MICR_JABBER_INT_EN_GET(x) (((uint16_t)(x) & DP83867_MICR_JABBER_INT_EN_MASK) >> DP83867_MICR_JABBER_INT_EN_SHIFT)

/* Bitfield definition for register: ISR */
/*
 * AUTONEG_ERR_INT (RO, LH, COR)
 *
 * Auto-Negotiation Error Interrupt:
 * 1 = Auto-Negotiation Error interrupt is pending and is cleared by the
 * current read.
 * 0 = No Auto-Negotiation Error interrupt.
 */
#define DP83867_ISR_AUTONEG_ERR_INT_MASK (0x8000U)
#define DP83867_ISR_AUTONEG_ERR_INT_SHIFT (15U)
#define DP83867_ISR_AUTONEG_ERR_INT_GET(x) (((uint16_t)(x) & DP83867_ISR_AUTONEG_ERR_INT_MASK) >> DP83867_ISR_AUTONEG_ERR_INT_SHIFT)

/*
 * SPEED_CHNG_INT (RO, LH, COR)
 *
 * Speed Change Interrupt:
 * 1 = Speed Change interrupt is pending and is cleared by the current
 * read.
 * 0 = No Speed Change interrupt.
 */
#define DP83867_ISR_SPEED_CHNG_INT_MASK (0x4000U)
#define DP83867_ISR_SPEED_CHNG_INT_SHIFT (14U)
#define DP83867_ISR_SPEED_CHNG_INT_GET(x) (((uint16_t)(x) & DP83867_ISR_SPEED_CHNG_INT_MASK) >> DP83867_ISR_SPEED_CHNG_INT_SHIFT)

/*
 * DUPLEX_MODE_CHNG_INT (RO, LH, COR)
 *
 * Duplex Mode Change Interrupt:
 * 1 = Duplex Mode Change interrupt is pending and is cleared by the
 * current read.
 * 0 = No Duplex Mode Change interrupt.
 */
#define DP83867_ISR_DUPLEX_MODE_CHNG_INT_MASK (0x2000U)
#define DP83867_ISR_DUPLEX_MODE_CHNG_INT_SHIFT (13U)
#define DP83867_ISR_DUPLEX_MODE_CHNG_INT_GET(x) (((uint16_t)(x) & DP83867_ISR_DUPLEX_MODE_CHNG_INT_MASK) >> DP83867_ISR_DUPLEX_MODE_CHNG_INT_SHIFT)

/*
 * PAGE_RECEIVED_INT (RO, LH, COR)
 *
 * Page Received Interrupt:
 * 1 = Page Received Interrupt is pending and is cleared by the
 * current read.
 * 0 = No Page Received Interrupt is pending.
 */
#define DP83867_ISR_PAGE_RECEIVED_INT_MASK (0x1000U)
#define DP83867_ISR_PAGE_RECEIVED_INT_SHIFT (12U)
#define DP83867_ISR_PAGE_RECEIVED_INT_GET(x) (((uint16_t)(x) & DP83867_ISR_PAGE_RECEIVED_INT_MASK) >> DP83867_ISR_PAGE_RECEIVED_INT_SHIFT)

/*
 * AUTONEG_COMP_INT (RO, LH, COR)
 *
 * Auto-Negotiation Complete Interrupt:
 * 1 = Auto-Negotiation Complete Interrupt is pending and is cleared
 * by the current read.
 * 0 = No Auto-Negotiation Complete Interrupt is pending.
 */
#define DP83867_ISR_AUTONEG_COMP_INT_MASK (0x800U)
#define DP83867_ISR_AUTONEG_COMP_INT_SHIFT (11U)
#define DP83867_ISR_AUTONEG_COMP_INT_GET(x) (((uint16_t)(x) & DP83867_ISR_AUTONEG_COMP_INT_MASK) >> DP83867_ISR_AUTONEG_COMP_INT_SHIFT)

/*
 * LINK_STATUS_CHNG_INT (RO, LH, COR)
 *
 * Link Status Change Interrupt:
 * 1 = Link Status Change interrupt is pending and is cleared by the
 * current read.
 * 0 = No Link Status Change interrupt is pending.
 */
#define DP83867_ISR_LINK_STATUS_CHNG_INT_MASK (0x400U)
#define DP83867_ISR_LINK_STATUS_CHNG_INT_SHIFT (10U)
#define DP83867_ISR_LINK_STATUS_CHNG_INT_GET(x) (((uint16_t)(x) & DP83867_ISR_LINK_STATUS_CHNG_INT_MASK) >> DP83867_ISR_LINK_STATUS_CHNG_INT_SHIFT)

/*
 * FALSE_CARRIER_INT ( RO, LH, COR)
 *
 * False Carrier Interrupt:
 * 1 = False Carrier interrupt is pending and is cleared by the current
 * read.
 * 0 = No False Carrier interrupt is pending.
 */
#define DP83867_ISR_FALSE_CARRIER_INT_MASK (0x100U)
#define DP83867_ISR_FALSE_CARRIER_INT_SHIFT (8U)
#define DP83867_ISR_FALSE_CARRIER_INT_GET(x) (((uint16_t)(x) & DP83867_ISR_FALSE_CARRIER_INT_MASK) >> DP83867_ISR_FALSE_CARRIER_INT_SHIFT)

/*
 * MDI_CROSSOVER_CHNG_INT (RO, LH, COR)
 *
 * MDI Crossover Change Interrupt:
 * 1 = MDI Crossover Change interrupt is pending and is cleared by
 * the current read.
 * 0 = No MDI Crossover Change interrupt is pending.
 */
#define DP83867_ISR_MDI_CROSSOVER_CHNG_INT_MASK (0x40U)
#define DP83867_ISR_MDI_CROSSOVER_CHNG_INT_SHIFT (6U)
#define DP83867_ISR_MDI_CROSSOVER_CHNG_INT_GET(x) (((uint16_t)(x) & DP83867_ISR_MDI_CROSSOVER_CHNG_INT_MASK) >> DP83867_ISR_MDI_CROSSOVER_CHNG_INT_SHIFT)

/*
 * SPEED_OPT_EVENT_INT (RO, LH, COR)
 *
 * Speed Optimization Event Interrupt:
 * 1 = Speed Optimization Event Interrupt is pending and is cleared by
 * the current read.
 * 0 = No Speed Optimization Event Interrupt is pending.
 */
#define DP83867_ISR_SPEED_OPT_EVENT_INT_MASK (0x20U)
#define DP83867_ISR_SPEED_OPT_EVENT_INT_SHIFT (5U)
#define DP83867_ISR_SPEED_OPT_EVENT_INT_GET(x) (((uint16_t)(x) & DP83867_ISR_SPEED_OPT_EVENT_INT_MASK) >> DP83867_ISR_SPEED_OPT_EVENT_INT_SHIFT)

