Evlers/gd32f4xx_rt-thread/libraries/drivers/drv_enet/enet_phy/dp83867/dp83867_regs.h
/*
 * SLEEP_MODE_CHNG_INT (RO, LH, COR)
 *
 * Sleep Mode Change Interrupt:
 * 1 = Sleep Mode Change Interrupt is pending and is cleared by the
 * current read.
 * 0 = No Sleep Mode Change Interrupt is pending.
 */
#define DP83867_ISR_SLEEP_MODE_CHNG_INT_MASK (0x10U)
#define DP83867_ISR_SLEEP_MODE_CHNG_INT_SHIFT (4U)
#define DP83867_ISR_SLEEP_MODE_CHNG_INT_GET(x) (((uint16_t)(x) & DP83867_ISR_SLEEP_MODE_CHNG_INT_MASK) >> DP83867_ISR_SLEEP_MODE_CHNG_INT_SHIFT)

/*
 * WOL_INT (RO, LH, COR)
 *
 * Wake-on-LAN Interrupt:
 * 1 = Wake-on-LAN Interrupt is pending.
 * 0 = No Wake-on-LAN Interrupt is pending.
 */
#define DP83867_ISR_WOL_INT_MASK (0x8U)
#define DP83867_ISR_WOL_INT_SHIFT (3U)
#define DP83867_ISR_WOL_INT_GET(x) (((uint16_t)(x) & DP83867_ISR_WOL_INT_MASK) >> DP83867_ISR_WOL_INT_SHIFT)

/*
 * XGMII_ERR_INT (RO, LH, COR)
 *
 * xGMII Error Interrupt:
 * 1 = xGMII Error Interrupt is pending and is cleared by the current
 * read.
 * 0 = No xGMII Error Interrupt is pending.
 */
#define DP83867_ISR_XGMII_ERR_INT_MASK (0x4U)
#define DP83867_ISR_XGMII_ERR_INT_SHIFT (2U)
#define DP83867_ISR_XGMII_ERR_INT_GET(x) (((uint16_t)(x) & DP83867_ISR_XGMII_ERR_INT_MASK) >> DP83867_ISR_XGMII_ERR_INT_SHIFT)

/*
 * POLARITY_CHNG_INT (RO, LH, COR)
 *
 * Polarity Change Interrupt:
 * 1 = Polarity Change interrupt is pending and is cleared by the
 * current read.
 * 0 = No Polarity Change interrupt is pending.
 */
#define DP83867_ISR_POLARITY_CHNG_INT_MASK (0x2U)
#define DP83867_ISR_POLARITY_CHNG_INT_SHIFT (1U)
#define DP83867_ISR_POLARITY_CHNG_INT_GET(x) (((uint16_t)(x) & DP83867_ISR_POLARITY_CHNG_INT_MASK) >> DP83867_ISR_POLARITY_CHNG_INT_SHIFT)

/*
 * JABBER_INT (RO, LH, COR)
 *
 * Jabber Interrupt:
 * 1 = Jabber interrupt is pending and is cleared by the current read.
 * 0 = No Jabber interrupt is pending.
 */
#define DP83867_ISR_JABBER_INT_MASK (0x1U)
#define DP83867_ISR_JABBER_INT_SHIFT (0U)
#define DP83867_ISR_JABBER_INT_GET(x) (((uint16_t)(x) & DP83867_ISR_JABBER_INT_MASK) >> DP83867_ISR_JABBER_INT_SHIFT)

/* Bitfield definition for register: CRG2 */
/*
 * INTERRUPT_POLARITY (RW)
 *
 * Configure Interrupt Polarity:
 * 1 = Interrupt pin is active low.
 * 0 = Interrupt pin is active high.
 */
#define DP83867_CRG2_INTERRUPT_POLARITY_MASK (0x2000U)
#define DP83867_CRG2_INTERRUPT_POLARITY_SHIFT (13U)
#define DP83867_CRG2_INTERRUPT_POLARITY_SET(x) (((uint16_t)(x) << DP83867_CRG2_INTERRUPT_POLARITY_SHIFT) & DP83867_CRG2_INTERRUPT_POLARITY_MASK)
#define DP83867_CRG2_INTERRUPT_POLARITY_GET(x) (((uint16_t)(x) & DP83867_CRG2_INTERRUPT_POLARITY_MASK) >> DP83867_CRG2_INTERRUPT_POLARITY_SHIFT)

/*
 * SPEED_OPT_ATTEMPT_CNT (RO)
 *
 * Speed Optimization Attempt Count:
 * Selects the number of 1000BASE-T link establishment attempt
 * failures prior to performing Speed Optimization.
 * 11 = 8
 * 10 = 4
 * 01 = 2
 * 00 = 1
 */
#define DP83867_CRG2_SPEED_OPT_ATTEMPT_CNT_MASK (0xC00U)
#define DP83867_CRG2_SPEED_OPT_ATTEMPT_CNT_SHIFT (10U)
#define DP83867_CRG2_SPEED_OPT_ATTEMPT_CNT_GET(x) (((uint16_t)(x) & DP83867_CRG2_SPEED_OPT_ATTEMPT_CNT_MASK) >> DP83867_CRG2_SPEED_OPT_ATTEMPT_CNT_SHIFT)

/*
 * SPEED_OPT_EN (RW)
 *
 * Speed Optimization Enable:
 * 1 = Enable Speed Optimization.
 * 0 = Disable Speed Optimization.
 */
#define DP83867_CRG2_SPEED_OPT_EN_MASK (0x200U)
#define DP83867_CRG2_SPEED_OPT_EN_SHIFT (9U)
#define DP83867_CRG2_SPEED_OPT_EN_SET(x) (((uint16_t)(x) << DP83867_CRG2_SPEED_OPT_EN_SHIFT) & DP83867_CRG2_SPEED_OPT_EN_MASK)
#define DP83867_CRG2_SPEED_OPT_EN_GET(x) (((uint16_t)(x) & DP83867_CRG2_SPEED_OPT_EN_MASK) >> DP83867_CRG2_SPEED_OPT_EN_SHIFT)

/*
 * SPEED_OPT_ENHANCED_EN (RW)
 *
 * Speed Optimization Enhanced Mode Enable:
 * In enhanced mode, speed is optimized if energy is not detected in
 * channels C and D.
 * 1 = Enable Speed Optimization enhanced mode.
 * 0 = Disable Speed Optimization enhanced mode.
 */
#define DP83867_CRG2_SPEED_OPT_ENHANCED_EN_MASK (0x100U)
#define DP83867_CRG2_SPEED_OPT_ENHANCED_EN_SHIFT (8U)
#define DP83867_CRG2_SPEED_OPT_ENHANCED_EN_SET(x) (((uint16_t)(x) << DP83867_CRG2_SPEED_OPT_ENHANCED_EN_SHIFT) & DP83867_CRG2_SPEED_OPT_ENHANCED_EN_MASK)
#define DP83867_CRG2_SPEED_OPT_ENHANCED_EN_GET(x) (((uint16_t)(x) & DP83867_CRG2_SPEED_OPT_ENHANCED_EN_MASK) >> DP83867_CRG2_SPEED_OPT_ENHANCED_EN_SHIFT)

/*
 * SGMII_AUTONEG_EN (RW)
 *
 * SGMII Auto-Negotiation Enable:
 * 1 = Enable SGMII Auto-Negotaition.
 * 0 = Disable SGMII Auto-Negotaition.
 */
#define DP83867_CRG2_SGMII_AUTONEG_EN_MASK (0x80U)
#define DP83867_CRG2_SGMII_AUTONEG_EN_SHIFT (7U)
#define DP83867_CRG2_SGMII_AUTONEG_EN_SET(x) (((uint16_t)(x) << DP83867_CRG2_SGMII_AUTONEG_EN_SHIFT) & DP83867_CRG2_SGMII_AUTONEG_EN_MASK)
#define DP83867_CRG2_SGMII_AUTONEG_EN_GET(x) (((uint16_t)(x) & DP83867_CRG2_SGMII_AUTONEG_EN_MASK) >> DP83867_CRG2_SGMII_AUTONEG_EN_SHIFT)

/*
 * SPEED_OPT_10M_EN (RW)
 *
 * Enable Speed Optimization to 10BASE-Te:
 * 1 = Enable speed optimization to 10BASE-Te if link establishment
 * fails in 1000BASE-T and 100BASE-TX .
 * 0 = Disable speed optimization to 10BASE-Te.
 */
#define DP83867_CRG2_SPEED_OPT_10M_EN_MASK (0x40U)
#define DP83867_CRG2_SPEED_OPT_10M_EN_SHIFT (6U)
#define DP83867_CRG2_SPEED_OPT_10M_EN_SET(x) (((uint16_t)(x) << DP83867_CRG2_SPEED_OPT_10M_EN_SHIFT) & DP83867_CRG2_SPEED_OPT_10M_EN_MASK)
#define DP83867_CRG2_SPEED_OPT_10M_EN_GET(x) (((uint16_t)(x) & DP83867_CRG2_SPEED_OPT_10M_EN_MASK) >> DP83867_CRG2_SPEED_OPT_10M_EN_SHIFT)

/* Bitfield definition for register: RECR */
/*
 * RXERCNT_15_0 (RO, WSC)
 *
 * RX_ER Counter:
 * Receive error counter. This register saturates at the maximum value
 * of 0xFFFF. It is cleared by dummy write to this register.
 */
#define DP83867_RECR_RXERCNT_15_0_MASK (0xFFFFU)
#define DP83867_RECR_RXERCNT_15_0_SHIFT (0U)
#define DP83867_RECR_RXERCNT_15_0_SET(x) (((uint16_t)(x) << DP83867_RECR_RXERCNT_15_0_SHIFT) & DP83867_RECR_RXERCNT_15_0_MASK)
#define DP83867_RECR_RXERCNT_15_0_GET(x) (((uint16_t)(x) & DP83867_RECR_RXERCNT_15_0_MASK) >> DP83867_RECR_RXERCNT_15_0_SHIFT)

/* Bitfield definition for register: STS2 */
/*
 * PRBS_LOCK (RO)
 *
 * PRBS Lock Status:
 * 1 = PRBS checker is locked to the received byte stream.
 * 0 = PRBS checker is not locked.
 */
#define DP83867_STS2_PRBS_LOCK_MASK (0x800U)
#define DP83867_STS2_PRBS_LOCK_SHIFT (11U)
#define DP83867_STS2_PRBS_LOCK_GET(x) (((uint16_t)(x) & DP83867_STS2_PRBS_LOCK_MASK) >> DP83867_STS2_PRBS_LOCK_SHIFT)

