Evlers/gd32f4xx_rt-thread/libraries/drivers/drv_enet/enet_phy/dp83867/dp83867_regs.h
/*
 * PRBS_LOCK_LOST (RO, LH, COR)
 *
 * PRBS Lock Lost:
 * 1 = PRBS checker has lost lock.
 * 0 = PRBS checker has not lost lock.
 */
#define DP83867_STS2_PRBS_LOCK_LOST_MASK (0x400U)
#define DP83867_STS2_PRBS_LOCK_LOST_SHIFT (10U)
#define DP83867_STS2_PRBS_LOCK_LOST_GET(x) (((uint16_t)(x) & DP83867_STS2_PRBS_LOCK_LOST_MASK) >> DP83867_STS2_PRBS_LOCK_LOST_SHIFT)

/*
 * PKT_GEN_BUSY (RO)
 *
 * Packet Generator Busy:
 * 1 = Packet generation is in process.
 * 0 = Packet generation is not in process.
 */
#define DP83867_STS2_PKT_GEN_BUSY_MASK (0x200U)
#define DP83867_STS2_PKT_GEN_BUSY_SHIFT (9U)
#define DP83867_STS2_PKT_GEN_BUSY_GET(x) (((uint16_t)(x) & DP83867_STS2_PKT_GEN_BUSY_MASK) >> DP83867_STS2_PKT_GEN_BUSY_SHIFT)

/*
 * SCR_MODE_MASTER_1G (RO)
 *
 * Gigabit Master Scramble Mode:
 * 1 = 1G PCS (master) is in legacy encoding mode.
 * 0 = 1G PCS (master) is in normal encoding mode..
 */
#define DP83867_STS2_SCR_MODE_MASTER_1G_MASK (0x100U)
#define DP83867_STS2_SCR_MODE_MASTER_1G_SHIFT (8U)
#define DP83867_STS2_SCR_MODE_MASTER_1G_GET(x) (((uint16_t)(x) & DP83867_STS2_SCR_MODE_MASTER_1G_MASK) >> DP83867_STS2_SCR_MODE_MASTER_1G_SHIFT)

/*
 * SCR_MODE_SLAVE_1G (RO)
 *
 * Gigabit Slave Scramble Mode:
 * 1 = 1G PCS (slave) is in legacy encoding mode.
 * 0 = 1G PCS (slave) is in normal encoding mode..
 */
#define DP83867_STS2_SCR_MODE_SLAVE_1G_MASK (0x80U)
#define DP83867_STS2_SCR_MODE_SLAVE_1G_SHIFT (7U)
#define DP83867_STS2_SCR_MODE_SLAVE_1G_GET(x) (((uint16_t)(x) & DP83867_STS2_SCR_MODE_SLAVE_1G_MASK) >> DP83867_STS2_SCR_MODE_SLAVE_1G_SHIFT)

/*
 * CORE_PWR_MODE (RO)
 *
 * Core Power Mode:
 * 1 = Core is in normal power mode.
 * 0 = Core is power-down mode or in sleep mode.
 */
#define DP83867_STS2_CORE_PWR_MODE_MASK (0x40U)
#define DP83867_STS2_CORE_PWR_MODE_SHIFT (6U)
#define DP83867_STS2_CORE_PWR_MODE_GET(x) (((uint16_t)(x) & DP83867_STS2_CORE_PWR_MODE_MASK) >> DP83867_STS2_CORE_PWR_MODE_SHIFT)

/* Bitfield definition for register: LEDCR1 */
/*
 * LED_GPIO_SEL (RW)
 *
 * Source of the GPIO LED_3:
 * 1111: Reserved
 * 1110: Receive Error
 * 1101: Receive Error or Transmit Error
 * 1100: RESERVED
 * 1011: Link established, blink for transmit or receive activity
 * 1010: Full duplex
 * 1001: 100/1000BT link established
 * 1000: 10/100BT link established
 * 0111: 10BT link established
 * 0110: 100 BTX link established
 * 0101: 1000BT link established
 * 0100: Collision detected
 * 0011: Receive activity
 * 0010: Transmit activity
 * 0001: Receive or Transmit activity
 * 0000: Link established
 */
#define DP83867_LEDCR1_LED_GPIO_SEL_MASK (0xF000U)
#define DP83867_LEDCR1_LED_GPIO_SEL_SHIFT (12U)
#define DP83867_LEDCR1_LED_GPIO_SEL_SET(x) (((uint16_t)(x) << DP83867_LEDCR1_LED_GPIO_SEL_SHIFT) & DP83867_LEDCR1_LED_GPIO_SEL_MASK)
#define DP83867_LEDCR1_LED_GPIO_SEL_GET(x) (((uint16_t)(x) & DP83867_LEDCR1_LED_GPIO_SEL_MASK) >> DP83867_LEDCR1_LED_GPIO_SEL_SHIFT)

/*
 * LED_2_SEL (RW)
 *
 * Source of LED_2:
 * 1111: Reserved
 * 1110: Receive Error
 * 1101: Receive Error or Transmit Error
 * 1100: RESERVED
 * 1011: Link established, blink for transmit or receive activity
 * 1010: Full duplex
 * 1001: 100/1000BT link established
 * 1000: 10/100BT link established
 * 0111: 10BT link established
 * 0110: 100 BTX link established
 * 0101: 1000BT link established
 * 0100: Collision detected
 * 0011: Receive activity
 * 0010: Transmit activity
 * 0001: Receive or Transmit activity
 * 0000: Link established
 */
#define DP83867_LEDCR1_LED_2_SEL_MASK (0xF00U)
#define DP83867_LEDCR1_LED_2_SEL_SHIFT (8U)
#define DP83867_LEDCR1_LED_2_SEL_SET(x) (((uint16_t)(x) << DP83867_LEDCR1_LED_2_SEL_SHIFT) & DP83867_LEDCR1_LED_2_SEL_MASK)
#define DP83867_LEDCR1_LED_2_SEL_GET(x) (((uint16_t)(x) & DP83867_LEDCR1_LED_2_SEL_MASK) >> DP83867_LEDCR1_LED_2_SEL_SHIFT)

/*
 * LED_1_SEL (RW)
 *
 * Source of LED_1:
 * 1111: Reserved
 * 1110: Receive Error
 * 1101: Receive Error or Transmit Error
 * 1100: RESERVED
 * 1011: Link established, blink for transmit or receive activity
 * 1010: Full duplex
 * 1001: 100/1000BT link established
 * 1000: 10/100BT link established
 * 0111: 10BT link established
 * 0110: 100 BTX link established
 * 0101: 1000BT link established
 * 0100: Collision detected
 * 0011: Receive activity
 * 0010: Transmit activity
 * 0001: Receive or Transmit activity
 * 0000: Link established
 */
#define DP83867_LEDCR1_LED_1_SEL_MASK (0xF0U)
#define DP83867_LEDCR1_LED_1_SEL_SHIFT (4U)
#define DP83867_LEDCR1_LED_1_SEL_SET(x) (((uint16_t)(x) << DP83867_LEDCR1_LED_1_SEL_SHIFT) & DP83867_LEDCR1_LED_1_SEL_MASK)
#define DP83867_LEDCR1_LED_1_SEL_GET(x) (((uint16_t)(x) & DP83867_LEDCR1_LED_1_SEL_MASK) >> DP83867_LEDCR1_LED_1_SEL_SHIFT)

/*
 * LED_0_SEL (RW)
 *
 * Source of LED_0:
 * 1111: Reserved
 * 1110: Receive Error
 * 1101: Receive Error or Transmit Error
 * 1100: RESERVED
 * 1011: Link established, blink for transmit or receive activity
 * 1010: Full duplex
 * 1001: 100/1000BT link established
 * 1000: 10/100BT link established
 * 0111: 10BT link established
 * 0110: 100 BTX link established
 * 0101: 1000BT link established
 * 0100: Collision detected
 * 0011: Receive activity
 * 0010: Transmit activity
 * 0001: Receive or Transmit activity
 * 0000: Link established
 */
#define DP83867_LEDCR1_LED_0_SEL_MASK (0xFU)
#define DP83867_LEDCR1_LED_0_SEL_SHIFT (0U)
#define DP83867_LEDCR1_LED_0_SEL_SET(x) (((uint16_t)(x) << DP83867_LEDCR1_LED_0_SEL_SHIFT) & DP83867_LEDCR1_LED_0_SEL_MASK)
#define DP83867_LEDCR1_LED_0_SEL_GET(x) (((uint16_t)(x) & DP83867_LEDCR1_LED_0_SEL_MASK) >> DP83867_LEDCR1_LED_0_SEL_SHIFT)

/* Bitfield definition for register: LEDCR2 */
/*
 * LED_GPIO_POLARITY (RW)
 *
 * GPIO LED Polarity:
 * 1 = Active high
 * 0 = Active low
 */
#define DP83867_LEDCR2_LED_GPIO_POLARITY_MASK (0x4000U)
#define DP83867_LEDCR2_LED_GPIO_POLARITY_SHIFT (14U)
#define DP83867_LEDCR2_LED_GPIO_POLARITY_SET(x) (((uint16_t)(x) << DP83867_LEDCR2_LED_GPIO_POLARITY_SHIFT) & DP83867_LEDCR2_LED_GPIO_POLARITY_MASK)
#define DP83867_LEDCR2_LED_GPIO_POLARITY_GET(x) (((uint16_t)(x) & DP83867_LEDCR2_LED_GPIO_POLARITY_MASK) >> DP83867_LEDCR2_LED_GPIO_POLARITY_SHIFT)

