Evlers/gd32f4xx_rt-thread/libraries/drivers/drv_enet/enet_phy/dp83867/dp83867_regs.h
/*
 * LED_GPIO_DRV_VAL (RW)
 *
 * GPIO LED Drive Value:
 * Value to force on GPIO LED
 * This bit is only valid if enabled through LED_GPIO_DRV_EN.
 */
#define DP83867_LEDCR2_LED_GPIO_DRV_VAL_MASK (0x2000U)
#define DP83867_LEDCR2_LED_GPIO_DRV_VAL_SHIFT (13U)
#define DP83867_LEDCR2_LED_GPIO_DRV_VAL_SET(x) (((uint16_t)(x) << DP83867_LEDCR2_LED_GPIO_DRV_VAL_SHIFT) & DP83867_LEDCR2_LED_GPIO_DRV_VAL_MASK)
#define DP83867_LEDCR2_LED_GPIO_DRV_VAL_GET(x) (((uint16_t)(x) & DP83867_LEDCR2_LED_GPIO_DRV_VAL_MASK) >> DP83867_LEDCR2_LED_GPIO_DRV_VAL_SHIFT)

/*
 * LED_GPIO_DRV_EN (RW)
 *
 * GPIO LED Drive Enable:
 * 1 = Force the value of the LED_GPIO_DRV_VAL bit onto the GPIO
 * LED.
 * 0 = Normal operation
 */
#define DP83867_LEDCR2_LED_GPIO_DRV_EN_MASK (0x1000U)
#define DP83867_LEDCR2_LED_GPIO_DRV_EN_SHIFT (12U)
#define DP83867_LEDCR2_LED_GPIO_DRV_EN_SET(x) (((uint16_t)(x) << DP83867_LEDCR2_LED_GPIO_DRV_EN_SHIFT) & DP83867_LEDCR2_LED_GPIO_DRV_EN_MASK)
#define DP83867_LEDCR2_LED_GPIO_DRV_EN_GET(x) (((uint16_t)(x) & DP83867_LEDCR2_LED_GPIO_DRV_EN_MASK) >> DP83867_LEDCR2_LED_GPIO_DRV_EN_SHIFT)

/*
 * LED_2_POLARITY (RW)
 *
 * LED_2 Polarity:
 * 1 = Active high
 * 0 = Active low
 */
#define DP83867_LEDCR2_LED_2_POLARITY_MASK (0x400U)
#define DP83867_LEDCR2_LED_2_POLARITY_SHIFT (10U)
#define DP83867_LEDCR2_LED_2_POLARITY_SET(x) (((uint16_t)(x) << DP83867_LEDCR2_LED_2_POLARITY_SHIFT) & DP83867_LEDCR2_LED_2_POLARITY_MASK)
#define DP83867_LEDCR2_LED_2_POLARITY_GET(x) (((uint16_t)(x) & DP83867_LEDCR2_LED_2_POLARITY_MASK) >> DP83867_LEDCR2_LED_2_POLARITY_SHIFT)

/*
 * LED_2_DRV_VAL (RW)
 *
 * LED_2 Drive Value:
 * Value to force on LED_2
 * This bit is only valid if enabled through LED_2_DRV_EN.
 */
#define DP83867_LEDCR2_LED_2_DRV_VAL_MASK (0x200U)
#define DP83867_LEDCR2_LED_2_DRV_VAL_SHIFT (9U)
#define DP83867_LEDCR2_LED_2_DRV_VAL_SET(x) (((uint16_t)(x) << DP83867_LEDCR2_LED_2_DRV_VAL_SHIFT) & DP83867_LEDCR2_LED_2_DRV_VAL_MASK)
#define DP83867_LEDCR2_LED_2_DRV_VAL_GET(x) (((uint16_t)(x) & DP83867_LEDCR2_LED_2_DRV_VAL_MASK) >> DP83867_LEDCR2_LED_2_DRV_VAL_SHIFT)

/*
 * LED_2_DRV_EN (RW)
 *
 * LED_2 Drive Enable:
 * 1 = Force the value of the LED_2_DRV_VAL bit onto LED_2.
 * 0 = Normal operation
 */
#define DP83867_LEDCR2_LED_2_DRV_EN_MASK (0x100U)
#define DP83867_LEDCR2_LED_2_DRV_EN_SHIFT (8U)
#define DP83867_LEDCR2_LED_2_DRV_EN_SET(x) (((uint16_t)(x) << DP83867_LEDCR2_LED_2_DRV_EN_SHIFT) & DP83867_LEDCR2_LED_2_DRV_EN_MASK)
#define DP83867_LEDCR2_LED_2_DRV_EN_GET(x) (((uint16_t)(x) & DP83867_LEDCR2_LED_2_DRV_EN_MASK) >> DP83867_LEDCR2_LED_2_DRV_EN_SHIFT)

/*
 * LED_1_POLARITY (RW)
 *
 * LED_1 Polarity:
 * 1 = Active high
 * 0 = Active low
 */
#define DP83867_LEDCR2_LED_1_POLARITY_MASK (0x40U)
#define DP83867_LEDCR2_LED_1_POLARITY_SHIFT (6U)
#define DP83867_LEDCR2_LED_1_POLARITY_SET(x) (((uint16_t)(x) << DP83867_LEDCR2_LED_1_POLARITY_SHIFT) & DP83867_LEDCR2_LED_1_POLARITY_MASK)
#define DP83867_LEDCR2_LED_1_POLARITY_GET(x) (((uint16_t)(x) & DP83867_LEDCR2_LED_1_POLARITY_MASK) >> DP83867_LEDCR2_LED_1_POLARITY_SHIFT)

/*
 * LED_1_DRV_VAL (RW)
 *
 * LED_1 Drive Value:
 * Value to force on LED_1
 * This bit is only valid if enabled through LED_1_DRV_EN.
 */
#define DP83867_LEDCR2_LED_1_DRV_VAL_MASK (0x20U)
#define DP83867_LEDCR2_LED_1_DRV_VAL_SHIFT (5U)
#define DP83867_LEDCR2_LED_1_DRV_VAL_SET(x) (((uint16_t)(x) << DP83867_LEDCR2_LED_1_DRV_VAL_SHIFT) & DP83867_LEDCR2_LED_1_DRV_VAL_MASK)
#define DP83867_LEDCR2_LED_1_DRV_VAL_GET(x) (((uint16_t)(x) & DP83867_LEDCR2_LED_1_DRV_VAL_MASK) >> DP83867_LEDCR2_LED_1_DRV_VAL_SHIFT)

/*
 * LED_1_DRV_EN (RW)
 *
 * LED_1 Drive Enable:
 * 1 = Force the value of the LED_1_DRV_VAL bit onto LED_1.
 * 0 = Normal operation
 */
#define DP83867_LEDCR2_LED_1_DRV_EN_MASK (0x10U)
#define DP83867_LEDCR2_LED_1_DRV_EN_SHIFT (4U)
#define DP83867_LEDCR2_LED_1_DRV_EN_SET(x) (((uint16_t)(x) << DP83867_LEDCR2_LED_1_DRV_EN_SHIFT) & DP83867_LEDCR2_LED_1_DRV_EN_MASK)
#define DP83867_LEDCR2_LED_1_DRV_EN_GET(x) (((uint16_t)(x) & DP83867_LEDCR2_LED_1_DRV_EN_MASK) >> DP83867_LEDCR2_LED_1_DRV_EN_SHIFT)

/*
 * LED_0_POLARITY (RW)
 *
 * LED_0 Polarity:
 * 1 = Active high
 * 0 = Active low
 */
#define DP83867_LEDCR2_LED_0_POLARITY_MASK (0x4U)
#define DP83867_LEDCR2_LED_0_POLARITY_SHIFT (2U)
#define DP83867_LEDCR2_LED_0_POLARITY_SET(x) (((uint16_t)(x) << DP83867_LEDCR2_LED_0_POLARITY_SHIFT) & DP83867_LEDCR2_LED_0_POLARITY_MASK)
#define DP83867_LEDCR2_LED_0_POLARITY_GET(x) (((uint16_t)(x) & DP83867_LEDCR2_LED_0_POLARITY_MASK) >> DP83867_LEDCR2_LED_0_POLARITY_SHIFT)

/*
 * LED_0_DRV_VAL (RW)
 *
 * LED_0 Drive Value:
 * Value to force on LED_0
 * This bit is only valid if enabled through LED_0_DRV_EN.
 */
#define DP83867_LEDCR2_LED_0_DRV_VAL_MASK (0x2U)
#define DP83867_LEDCR2_LED_0_DRV_VAL_SHIFT (1U)
#define DP83867_LEDCR2_LED_0_DRV_VAL_SET(x) (((uint16_t)(x) << DP83867_LEDCR2_LED_0_DRV_VAL_SHIFT) & DP83867_LEDCR2_LED_0_DRV_VAL_MASK)
#define DP83867_LEDCR2_LED_0_DRV_VAL_GET(x) (((uint16_t)(x) & DP83867_LEDCR2_LED_0_DRV_VAL_MASK) >> DP83867_LEDCR2_LED_0_DRV_VAL_SHIFT)

/*
 * LED_0_DRV_EN (RW)
 *
 * LED_0 Drive Enable:
 * 1 = Force the value of the LED_0_DRV_VAL bit onto LED_0.
 * 0 = Normal operation
 */
#define DP83867_LEDCR2_LED_0_DRV_EN_MASK (0x1U)
#define DP83867_LEDCR2_LED_0_DRV_EN_SHIFT (0U)
#define DP83867_LEDCR2_LED_0_DRV_EN_SET(x) (((uint16_t)(x) << DP83867_LEDCR2_LED_0_DRV_EN_SHIFT) & DP83867_LEDCR2_LED_0_DRV_EN_MASK)
#define DP83867_LEDCR2_LED_0_DRV_EN_GET(x) (((uint16_t)(x) & DP83867_LEDCR2_LED_0_DRV_EN_MASK) >> DP83867_LEDCR2_LED_0_DRV_EN_SHIFT)

/* Bitfield definition for register: LEDCR3 */
/*
 * LEDS_BYPASS_STRETCHING (RW)
 *
 * Bypass LED Stretching:
 * 1 = Bypass LED Stretching
 * 0 = Normal operation
 */
#define DP83867_LEDCR3_LEDS_BYPASS_STRETCHING_MASK (0x4U)
#define DP83867_LEDCR3_LEDS_BYPASS_STRETCHING_SHIFT (2U)
#define DP83867_LEDCR3_LEDS_BYPASS_STRETCHING_SET(x) (((uint16_t)(x) << DP83867_LEDCR3_LEDS_BYPASS_STRETCHING_SHIFT) & DP83867_LEDCR3_LEDS_BYPASS_STRETCHING_MASK)
#define DP83867_LEDCR3_LEDS_BYPASS_STRETCHING_GET(x) (((uint16_t)(x) & DP83867_LEDCR3_LEDS_BYPASS_STRETCHING_MASK) >> DP83867_LEDCR3_LEDS_BYPASS_STRETCHING_SHIFT)

