Evlers/gd32f4xx_rt-thread/libraries/drivers/drv_enet/enet_phy/dp83867/dp83867_regs.h
/*
 * LEDS_BLINK_RATE (RW)
 *
 * LED Blink Rate:
 * 11: 2 Hz (500 ms)
 * 10: 5 Hz (200 ms)
 * 01: 10 Hz (100 ms)
 * 00 = 20 Hz (50 ms)
 */
#define DP83867_LEDCR3_LEDS_BLINK_RATE_MASK (0x3U)
#define DP83867_LEDCR3_LEDS_BLINK_RATE_SHIFT (0U)
#define DP83867_LEDCR3_LEDS_BLINK_RATE_SET(x) (((uint16_t)(x) << DP83867_LEDCR3_LEDS_BLINK_RATE_SHIFT) & DP83867_LEDCR3_LEDS_BLINK_RATE_MASK)
#define DP83867_LEDCR3_LEDS_BLINK_RATE_GET(x) (((uint16_t)(x) & DP83867_LEDCR3_LEDS_BLINK_RATE_MASK) >> DP83867_LEDCR3_LEDS_BLINK_RATE_SHIFT)

/* Bitfield definition for register: CFG3 */
/*
 * FAST_LINK_UP_IN_PARALLEL_DETECT (RW)
 *
 * Fast Link-Up in Parallel Detect Mode:
 * 1 = Enable Fast Link-Up time During Parallel Detection
 * 0 = Normal Parallel Detection link establishment
 * In Fast Auto MDI-X this bit is automatically set.
 */
#define DP83867_CFG3_FAST_LINK_UP_IN_PARALLEL_DETECT_MASK (0x8000U)
#define DP83867_CFG3_FAST_LINK_UP_IN_PARALLEL_DETECT_SHIFT (15U)
#define DP83867_CFG3_FAST_LINK_UP_IN_PARALLEL_DETECT_SET(x) (((uint16_t)(x) << DP83867_CFG3_FAST_LINK_UP_IN_PARALLEL_DETECT_SHIFT) & DP83867_CFG3_FAST_LINK_UP_IN_PARALLEL_DETECT_MASK)
#define DP83867_CFG3_FAST_LINK_UP_IN_PARALLEL_DETECT_GET(x) (((uint16_t)(x) & DP83867_CFG3_FAST_LINK_UP_IN_PARALLEL_DETECT_MASK) >> DP83867_CFG3_FAST_LINK_UP_IN_PARALLEL_DETECT_SHIFT)

/*
 * FAST_AN_ENABLE (RW)
 *
 * Fast Auto-Negotiation Enable:
 * 1 = Enable Fast Auto-Negotiation mode – The PHY auto-
 * negotiates using Timer setting according to Fast AN Sel bits
 * 0 = Disable Fast Auto-Negotiation mode – The PHY auto-
 * negotiates using normal Timer setting
 * Adjusting these bits reduces the time it takes to Auto-negotiate
 * between two PHYs. Note: When using this option care must be
 * taken to maintain proper operation of the system. While shortening
 * these timer intervals may not cause problems in normal operation,
 * there are certain situations where this may lead to problems.
 */
#define DP83867_CFG3_FAST_AN_ENABLE_MASK (0x4000U)
#define DP83867_CFG3_FAST_AN_ENABLE_SHIFT (14U)
#define DP83867_CFG3_FAST_AN_ENABLE_SET(x) (((uint16_t)(x) << DP83867_CFG3_FAST_AN_ENABLE_SHIFT) & DP83867_CFG3_FAST_AN_ENABLE_MASK)
#define DP83867_CFG3_FAST_AN_ENABLE_GET(x) (((uint16_t)(x) & DP83867_CFG3_FAST_AN_ENABLE_MASK) >> DP83867_CFG3_FAST_AN_ENABLE_SHIFT)

/*
 * FAST_AN_SEL (RW)
 *
 * Fast Auto-Negotiation Select bits:
 * Fast AN Select  Break Link Timer(ms)    Link Fail Inhibit TImer(ms)   Auto-Neg Wait Timer(ms)
 * <00>            80                      50                            35
 * <01>            120                     75                            50
 * <10>            240                     150                           100
 * <11>            NA                      NA                            NA
 * Adjusting these bits reduces the time it takes to auto-negotiate
 * between two PHYs. In Fast AN mode, both PHYs should be
 * configured to the same configuration. These 2 bits define the
 * duration for each state of the Auto-Negotiation process according
 * to the table above. The new duration time must be enabled by
 * setting Fast AN En - bit 4 of this register. Note: Using this mode in
 * cases where both link partners are not configured to the same
 * Fast Auto-Negotiation configuration might produce scenarios with
 * unexpected behavior.
 */
#define DP83867_CFG3_FAST_AN_SEL_MASK (0x3000U)
#define DP83867_CFG3_FAST_AN_SEL_SHIFT (12U)
#define DP83867_CFG3_FAST_AN_SEL_SET(x) (((uint16_t)(x) << DP83867_CFG3_FAST_AN_SEL_SHIFT) & DP83867_CFG3_FAST_AN_SEL_MASK)
#define DP83867_CFG3_FAST_AN_SEL_GET(x) (((uint16_t)(x) & DP83867_CFG3_FAST_AN_SEL_MASK) >> DP83867_CFG3_FAST_AN_SEL_SHIFT)

/*
 * EXTENDED_FD_ABILITY (RW)
 *
 * Extended Full-Duplex Ability:
 * 1 = Force Full-Duplex while working with link partner in forced
 * 100B-TX. When the PHY is set to Auto-Negotiation or Force 100B-
 * TX and the link partner is operated in Force 100B-TX, the link is
 * always Full Duplex
 * 0 = Disable Extended Full Duplex Ability. Decision to work in Full
 * Duplex or Half Duplex mode follows IEEE specification.
 */
#define DP83867_CFG3_EXTENDED_FD_ABILITY_MASK (0x800U)
#define DP83867_CFG3_EXTENDED_FD_ABILITY_SHIFT (11U)
#define DP83867_CFG3_EXTENDED_FD_ABILITY_SET(x) (((uint16_t)(x) << DP83867_CFG3_EXTENDED_FD_ABILITY_SHIFT) & DP83867_CFG3_EXTENDED_FD_ABILITY_MASK)
#define DP83867_CFG3_EXTENDED_FD_ABILITY_GET(x) (((uint16_t)(x) & DP83867_CFG3_EXTENDED_FD_ABILITY_MASK) >> DP83867_CFG3_EXTENDED_FD_ABILITY_SHIFT)

/*
 * ROBUST_AUTO_MDIX (RW)
 *
 * Robust Auto-MDIX:
 * 1 =Enable Robust Auto MDI/MDIX resolution
 * 0 = Normal Auto MDI/MDIX mode
 * If link partners are configured to operational modes that are not
 * supported by normal Auto MDI/MDIX mode (like Auto-Neg versus
 * Force 100Base-TX or Force 100Base-TX versus Force 100Base-
 * TX), this Robust Auto MDI/MDIX mode allows MDI/MDIX
 * resolution and prevents deadlock.
 */
#define DP83867_CFG3_ROBUST_AUTO_MDIX_MASK (0x200U)
#define DP83867_CFG3_ROBUST_AUTO_MDIX_SHIFT (9U)
#define DP83867_CFG3_ROBUST_AUTO_MDIX_SET(x) (((uint16_t)(x) << DP83867_CFG3_ROBUST_AUTO_MDIX_SHIFT) & DP83867_CFG3_ROBUST_AUTO_MDIX_MASK)
#define DP83867_CFG3_ROBUST_AUTO_MDIX_GET(x) (((uint16_t)(x) & DP83867_CFG3_ROBUST_AUTO_MDIX_MASK) >> DP83867_CFG3_ROBUST_AUTO_MDIX_SHIFT)

/*
 * FAST_AUTO_MDIX (RW)
 *
 * Fast Auto MDI/MDIX:
 * 1 = Enable Fast Auto MDI/MDIX mode
 * 0 = Normal Auto MDI/MDIX mode
 * If both link partners are configured to work in Force 100Base-TX
 * mode (Auto-Negotiation is disabled), this mode enables Automatic
 * MDI/MDIX resolution in a short time.
 */
#define DP83867_CFG3_FAST_AUTO_MDIX_MASK (0x100U)
#define DP83867_CFG3_FAST_AUTO_MDIX_SHIFT (8U)
#define DP83867_CFG3_FAST_AUTO_MDIX_SET(x) (((uint16_t)(x) << DP83867_CFG3_FAST_AUTO_MDIX_SHIFT) & DP83867_CFG3_FAST_AUTO_MDIX_MASK)
#define DP83867_CFG3_FAST_AUTO_MDIX_GET(x) (((uint16_t)(x) & DP83867_CFG3_FAST_AUTO_MDIX_MASK) >> DP83867_CFG3_FAST_AUTO_MDIX_SHIFT)

/*
 * INT_OE (RW)
 *
 * Interrupt Output Enable:
 * 1 = INTN/PWDNN Pad is an Interrupt Output.
 * 0 = INTN/PWDNN Pad in a Power-Down Input.
 */
#define DP83867_CFG3_INT_OE_MASK (0x80U)
#define DP83867_CFG3_INT_OE_SHIFT (7U)
#define DP83867_CFG3_INT_OE_SET(x) (((uint16_t)(x) << DP83867_CFG3_INT_OE_SHIFT) & DP83867_CFG3_INT_OE_MASK)
#define DP83867_CFG3_INT_OE_GET(x) (((uint16_t)(x) & DP83867_CFG3_INT_OE_MASK) >> DP83867_CFG3_INT_OE_SHIFT)

