Evlers/gd32f4xx_rt-thread/libraries/drivers/drv_enet/enet_phy/dp83867/dp83867_regs.h
/*
 * FORCE_INTERRUPT (RW)
 *
 * Force Interrupt:
 * 1 = Assert interrupt pin.
 * 0 = Normal interrupt mode.
 */
#define DP83867_CFG3_FORCE_INTERRUPT_MASK (0x40U)
#define DP83867_CFG3_FORCE_INTERRUPT_SHIFT (6U)
#define DP83867_CFG3_FORCE_INTERRUPT_SET(x) (((uint16_t)(x) << DP83867_CFG3_FORCE_INTERRUPT_SHIFT) & DP83867_CFG3_FORCE_INTERRUPT_MASK)
#define DP83867_CFG3_FORCE_INTERRUPT_GET(x) (((uint16_t)(x) & DP83867_CFG3_FORCE_INTERRUPT_MASK) >> DP83867_CFG3_FORCE_INTERRUPT_SHIFT)

/*
 * TDR_FAIL (RO)
 *
 * TDR Failure:
 * 1 = TDR failed.
 * 0 = Normal TDR operation.
 */
#define DP83867_CFG3_TDR_FAIL_MASK (0x4U)
#define DP83867_CFG3_TDR_FAIL_SHIFT (2U)
#define DP83867_CFG3_TDR_FAIL_GET(x) (((uint16_t)(x) & DP83867_CFG3_TDR_FAIL_MASK) >> DP83867_CFG3_TDR_FAIL_SHIFT)

/*
 * TDR_DONE (RO)
 *
 * TDR Done:
 * 1 = TDR has completed.
 * 0 = TDR has not completed.
 */
#define DP83867_CFG3_TDR_DONE_MASK (0x2U)
#define DP83867_CFG3_TDR_DONE_SHIFT (1U)
#define DP83867_CFG3_TDR_DONE_GET(x) (((uint16_t)(x) & DP83867_CFG3_TDR_DONE_MASK) >> DP83867_CFG3_TDR_DONE_SHIFT)

/*
 * TDR_START (RW)
 *
 * TDR Start:
 * 1 = Start TDR.
 * 0 = Normal operation
 */
#define DP83867_CFG3_TDR_START_MASK (0x1U)
#define DP83867_CFG3_TDR_START_SHIFT (0U)
#define DP83867_CFG3_TDR_START_SET(x) (((uint16_t)(x) << DP83867_CFG3_TDR_START_SHIFT) & DP83867_CFG3_TDR_START_MASK)
#define DP83867_CFG3_TDR_START_GET(x) (((uint16_t)(x) & DP83867_CFG3_TDR_START_MASK) >> DP83867_CFG3_TDR_START_SHIFT)

/* Bitfield definition for register: CTRL */
/*
 * SW_RESET (RW,SC)
 *
 * Software Reset:
 * 1 = Perform a full reset, including registers.
 * 0 = Normal operation.
 */
#define DP83867_CTRL_SW_RESET_MASK (0x8000U)
#define DP83867_CTRL_SW_RESET_SHIFT (15U)
#define DP83867_CTRL_SW_RESET_SET(x) (((uint16_t)(x) << DP83867_CTRL_SW_RESET_SHIFT) & DP83867_CTRL_SW_RESET_MASK)
#define DP83867_CTRL_SW_RESET_GET(x) (((uint16_t)(x) & DP83867_CTRL_SW_RESET_MASK) >> DP83867_CTRL_SW_RESET_SHIFT)

/*
 * SW_RESTART (RW,SC)
 *
 * Software Restart:
 * 1 = Perform a full reset, not including registers. .
 * 0 = Normal operation.
 */
#define DP83867_CTRL_SW_RESTART_MASK (0x4000U)
#define DP83867_CTRL_SW_RESTART_SHIFT (14U)
#define DP83867_CTRL_SW_RESTART_SET(x) (((uint16_t)(x) << DP83867_CTRL_SW_RESTART_SHIFT) & DP83867_CTRL_SW_RESTART_MASK)
#define DP83867_CTRL_SW_RESTART_GET(x) (((uint16_t)(x) & DP83867_CTRL_SW_RESTART_MASK) >> DP83867_CTRL_SW_RESTART_SHIFT)

/* Bitfield definition for register: RGMIIDCTL */
/*
 * RGMII_TX_DELAY_CTRL (RW)
 *
 * RGMII Transmit Clock Delay:
 * 1111: 4.00 ns
 * 1110: 3.75 ns
 * 1101: 3.50 ns
 * 1100: 3.25 ns
 * 1011: 3.00 ns
 * 1010: 2.75 ns
 * 1001: 2.50 ns
 * 1000: 2.25 ns
 * 0111: 2.00 ns
 * 0110: 1.75 ns
 * 0101: 1.50 ns
 * 0100: 1.25 ns
 * 0011: 1.00 ns
 * 0010: 0.75 ns
 * 0001: 0.50 ns
 * 0000: 0.25 ns
 */
#define DP83867_RGMIIDCTL_RGMII_TX_DELAY_CTRL_MASK (0xF0U)
#define DP83867_RGMIIDCTL_RGMII_TX_DELAY_CTRL_SHIFT (4U)
#define DP83867_RGMIIDCTL_RGMII_TX_DELAY_CTRL_SET(x) (((uint16_t)(x) << DP83867_RGMIIDCTL_RGMII_TX_DELAY_CTRL_SHIFT) & DP83867_RGMIIDCTL_RGMII_TX_DELAY_CTRL_MASK)
#define DP83867_RGMIIDCTL_RGMII_TX_DELAY_CTRL_GET(x) (((uint16_t)(x) & DP83867_RGMIIDCTL_RGMII_TX_DELAY_CTRL_MASK) >> DP83867_RGMIIDCTL_RGMII_TX_DELAY_CTRL_SHIFT)

/*
 * RGMII_RX_DELAY_CTRL (RW)
 *
 * RGMII Receive Clock Delay:
 * 1111: 4.00 ns
 * 1110: 3.75 ns
 * 1101: 3.50 ns
 * 1100: 3.25 ns
 * 1011: 3.00 ns
 * 1010: 2.75 ns
 * 1001: 2.50 ns
 * 1000: 2.25 ns
 * 0111: 2.00 ns
 * 0110: 1.75 ns
 * 0101: 1.50 ns
 * 0100: 1.25 ns
 * 0011: 1.00 ns
 * 0010: 0.75 ns
 * 0001: 0.50 ns
 * 0000: 0.25 ns
 */
#define DP83867_RGMIIDCTL_RGMII_RX_DELAY_CTRL_MASK (0xFU)
#define DP83867_RGMIIDCTL_RGMII_RX_DELAY_CTRL_SHIFT (0U)
#define DP83867_RGMIIDCTL_RGMII_RX_DELAY_CTRL_SET(x) (((uint16_t)(x) << DP83867_RGMIIDCTL_RGMII_RX_DELAY_CTRL_SHIFT) & DP83867_RGMIIDCTL_RGMII_RX_DELAY_CTRL_MASK)
#define DP83867_RGMIIDCTL_RGMII_RX_DELAY_CTRL_GET(x) (((uint16_t)(x) & DP83867_RGMIIDCTL_RGMII_RX_DELAY_CTRL_MASK) >> DP83867_RGMIIDCTL_RGMII_RX_DELAY_CTRL_SHIFT)




#endif /* _DP83867_REGS_H_ */
